openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
/********************************** (C) COPYRIGHT  *******************************
* File Name          : ch32x3x5.h
* Author             : WCH
* Version            : V1.0.1
* Date               : 2026/08/18
* Description        : CH32X3x5 Device Peripheral Access Layer Header File.
*********************************************************************************
* Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/  
#ifndef __CH32X3x5_H
#define __CH32X3x5_H

#ifdef __cplusplus
 extern "C" {
#endif 
  
#define __MPU_PRESENT             0 /* Other CH32 devices does not provide an MPU */
#define __Vendor_SysTickConfig    0 /* Set to 1 if different SysTick Config is used */	 
	 
#ifndef HSE_VALUE
#define HSE_VALUE    ((uint32_t)20000000) /* Value of the External oscillator in Hz */
#endif

/* In the following line adjust the External High Speed oscillator (HSE) Startup Timeout value */
#define HSE_STARTUP_TIMEOUT   ((uint32_t)0x1000000) /* Time out for HSE start up */

#define HSI_VALUE    ((uint32_t)20000000) /* Value of the Internal oscillator in Hz */

/* CH32X3x5 Standard Peripheral Library version number */
#define __CH32X3x5_STDPERIPH_VERSION_MAIN   (0x01) /* [15:8] main version */
#define __CH32X3x5_STDPERIPH_VERSION_SUB    (0x01) /* [7:0] sub version */
#define __CH32X3x5_STDPERIPH_VERSION        ( (__CH32X3x5_STDPERIPH_VERSION_MAIN << 8)\
                                             |(__CH32X3x5_STDPERIPH_VERSION_SUB << 0))


/* Interrupt Number Definition, according to the selected device */	 
typedef enum IRQn
{
 /******  RISC-V Processor Exceptions Numbers *******************************************************/
  NonMaskableInt_IRQn         = 2,       /* 2 Non Maskable Interrupt                             */
  HardFault_IRQn              = 3,       /* 3 Exception Interrupt                                */
  Ecall_M_Mode_IRQn           = 5,       /* 5 Ecall M Mode Interrupt                             */
  Ecall_U_Mode_IRQn           = 8,       /* 8 Ecall U Mode Interrupt                             */
  Break_Point_IRQn            = 9,       /* 9 Break Point Interrupt                              */
  SysTick_IRQn                = 12,      /* 12 System timer Interrupt                            */
  Software_IRQn               = 14,      /* 14 software Interrupt                                */

 /******  RISC-V specific Interrupt Numbers *********************************************************/
  WWDG_IRQn                   = 16,      /* Window WatchDog Interrupt                            */
  EXTI15_8_IRQn               = 17,      /* EXTI Line[15:8] Interrupt                            */
  FLASH_IRQn                  = 18,      /* FLASH global Interrupt                               */
  RCC_IRQn                    = 19,      /* RCC global Interrupt                                 */
  EXTI7_0_IRQn                = 20,      /* EXTI Line[7:0] Interrupt                             */
  SPI2_IRQn                   = 21,      /* SPI2 global Interrupt                                */
  DMA1_Channel1_IRQn          = 22,      /* DMA1 Channel 1 global Interrupt                      */
  DMA1_Channel2_IRQn          = 23,      /* DMA1 Channel 2 global Interrupt                      */
  DMA1_Channel3_IRQn          = 24,      /* DMA1 Channel 3 global Interrupt                      */
  DMA1_Channel4_IRQn          = 25,      /* DMA1 Channel 4 global Interrupt                      */
  DMA1_Channel5_IRQn          = 26,      /* DMA1 Channel 5 global Interrupt                      */
  DMA1_Channel6_IRQn          = 27,      /* DMA1 Channel 6 global Interrupt                      */
  DMA1_Channel7_IRQn          = 28,      /* DMA1 Channel 7 global Interrupt                      */
  DMA1_Channel8_IRQn          = 29,      /* DMA1 Channel 8 global Interrupt                      */
  DMA1_Channel9_IRQn          = 30,      /* DMA1 Channel 9 global Interrupt                      */
  DMA1_Channel10_IRQn         = 31,      /* DMA1 Channel 10 global Interrupt                     */
  DMA1_Channel11_IRQn         = 32,      /* DMA1 Channel 11 global Interrupt                     */
  USART2_IRQn                 = 33,      /* USART2 global Interrupt                              */
  I2C1_EV_IRQn                = 34,      /* I2C1 Event Interrupt                                 */
  I2C1_ER_IRQn                = 35,      /* I2C1 Error Interrupt                                 */
  USART1_IRQn                 = 36,      /* USART1 global Interrupt                              */
  SPI1_IRQn                   = 37,      /* SPI1 global Interrupt                                */
  TIM1_UP_IRQn                = 38,      /* TIM1 Update Interrupt                                */
  TIM1_CC_IRQn                = 39,      /* TIM1 Capture Compare Interrupt                       */
  TIM1_TRG_COM_IRQn           = 40,      /* TIM1 Trigger and Commutation Interrupt               */
  TIM1_BRK_IRQn               = 41,      /* TIM1 Break Interrupt                                 */
  TIM2_IRQn                   = 42,      /* TIM2 global Interrupt                                */
  I2C2_EV_IRQn                = 43,      /* I2C2 Event Interrupt                                 */
  I2C2_ER_IRQn                = 44,      /* I2C2 Error Interrupt                                 */
  USBPD_IRQn                  = 45,      /* USBPD global Interrupt                               */
  USBPDWakeUP_IRQn            = 46,      /* USBPD wakeup Interrupt                               */
  ARGB_IRQn                   = 47,      /* ARGB global Interrupt                                */
  TIM3_IRQn                   = 48,      /* TIM3 global Interrupt                                */
  TIM4_IRQn                   = 49,      /* TIM4 global Interrupt                                */
  SPI3_IRQn                   = 50,      /* SPI3 global Interrupt                                */
  USART3_IRQn                 = 51,      /* USART3 global Interrupt                              */
  USART4_IRQn                 = 52,      /* USART4 global Interrupt                              */
  USBSS_IRQn                  = 53,      /* USBSS global Interrupt                               */
  USBSS_LINK_IRQn             = 54,      /* USBSS Link global Interrupt                          */
  USBHS_IRQn                  = 55,      /* USBHS global Interrupt                               */
  USBHSWakeup_IRQn            = 56,      /* USBHS wakeup Interrupt                               */
  USBSSWakeup_IRQn            = 57,      /* USBSS wakeup Interrupt                               */
  PVD_IRQn                    = 58,      /* PVD Interrupt                                        */
  ADC1_IRQn                   = 59,      /* ADC1 global Interrupt                                */
  ADC2_IRQn                   = 60,      /* ADC2 global Interrupt                                */
  ADC3_IRQn                   = 61,      /* ADC3 global Interrupt                                */
  RTCAlarm_IRQn               = 62,      /* RTCAlarm_IRQn global Interrupt                       */
  RTC_IRQn                    = 63,      /* RTC global Interrupt                                 */
  USART_WKUP_IRQn             = 64,      /* USART wakeup Interrupt                               */
  ADC4_IRQn                   = 65,      /* ADC4 global Interrupt                                */
} IRQn_Type;

#include <stdint.h>
#include "core_riscv.h"
#include "system_ch32x3x5.h"

/* Standard Peripheral Library old definitions (maintained for legacy purpose) */

/* Analog to Digital Converter */
typedef struct
{
  __IO uint32_t STATR;
  __IO uint32_t CTLR1;
  __IO uint32_t CTLR2;
  __IO uint32_t SAMPTR1;
  __IO uint32_t SAMPTR2;
  __IO uint32_t IOFR1;
  __IO uint32_t IOFR2;
  __IO uint32_t IOFR3;
  __IO uint32_t IOFR4;
  __IO uint32_t WDHTR;
  __IO uint32_t WDLTR;
  __IO uint32_t RSQR1;
  __IO uint32_t RSQR2;
  __IO uint32_t RSQR3;
  __IO uint32_t ISQR;
  __IO uint32_t IDATAR1;
  __IO uint32_t IDATAR2;
  __IO uint32_t IDATAR3;
  __IO uint32_t IDATAR4;
  __IO uint32_t RDATAR;
  __IO uint32_t SMPMD;
  __IO uint32_t UDP;
  __IO uint32_t CONCFG;
  __IO uint32_t SCANCNT;
} ADC_TypeDef;

/* Addressable RGB */
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t DAT_ARR;
  __IO uint32_t RST_ARR;
  __IO uint32_t CCRL;
  __IO uint32_t CCRH;
  __IO uint32_t DAT_CYC;
  __IO uint32_t DATAR;
  __IO uint32_t STATR;
  __IO uint32_t CNTR;
} ARGB_TypeDef;

/* CRC Calculation Unit */
typedef struct
{
  __IO uint32_t DATAR;
  __IO uint8_t  IDATAR;
  uint8_t   RESERVED0;
  uint16_t  RESERVED1;
  __IO uint32_t CTLR;
} CRC_TypeDef;

/* DMA Channel Controller */
typedef struct
{
  __IO uint32_t CFGR;
  __IO uint32_t CNTR;
  __IO uint32_t PADDR;
  __IO uint32_t MADDR;
  __IO uint32_t M1ADDR;
} DMA_Channel_TypeDef;

/* DMA Controller */
typedef struct
{
  __IO uint32_t INTFR;
  __IO uint32_t INTFCR;
} DMA_TypeDef;

/* External Interrupt/Event Controller */
typedef struct
{
  __IO uint32_t INTENR; 
  __IO uint32_t EVENR;   
  __IO uint32_t RTENR;   
  __IO uint32_t FTENR;   
  __IO uint32_t SWIEVR;  
  __IO uint32_t INTFR;   
} EXTI_TypeDef;

/* FLASH Registers */
typedef struct
{
  __IO uint32_t ACTLR;
  __IO uint32_t KEYR;
  __IO uint32_t OBKEYR;
  __IO uint32_t STATR;
  __IO uint32_t CTLR;
  __IO uint32_t ADDR;
  uint32_t RESERVED;
  __IO uint32_t OBR;
  __IO uint32_t WPR;
  __IO uint32_t MODEKEYR;
  __IO uint32_t BOOT_MODEKEYR;
} FLASH_TypeDef;

/* Option Bytes Registers */  
typedef struct
{
  __IO uint16_t RDPR;
  __IO uint16_t USER;
  __IO uint16_t Data0;
  __IO uint16_t Data1;
  __IO uint16_t WRPR0;
  __IO uint16_t WRPR1;
  __IO uint16_t WRPR2;
  __IO uint16_t WRPR3;
} OB_TypeDef;

