openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
/* General Purpose I/O */
typedef struct
{
  __IO uint32_t CFGLR;
  __IO uint32_t CFGHR;
  __IO uint32_t INDR;
  __IO uint32_t OUTDR;
  __IO uint32_t BSHR;
  __IO uint32_t BCR;
  __IO uint32_t LCKR;
  __IO uint32_t SPEED;
} GPIO_TypeDef;

/* Alternate Function I/O */
typedef struct
{
  uint32_t RESERVED0;
  __IO uint32_t PCFR1;
  __IO uint32_t EXTICR[4];
  __IO uint32_t CR;
  uint32_t RESERVED1;
  __IO uint32_t GPIOA_AFLR;
  __IO uint32_t GPIOA_AFHR;
  __IO uint32_t GPIOB_AFLR;
  __IO uint32_t GPIOB_AFHR;
  __IO uint32_t GPIOC_AFLR;
  __IO uint32_t GPIOC_AFHR;
  __IO uint32_t GPIOD_AFLR;
  __IO uint32_t GPIOD_AFHR; 
} AFIO_TypeDef;

/* Inter Integrated Circuit Interface */
typedef struct
{
  __IO uint16_t CTLR1;
  uint16_t  RESERVED0;
  __IO uint16_t CTLR2;
  uint16_t  RESERVED1;
  __IO uint16_t OADDR1;
  uint16_t  RESERVED2;
  __IO uint16_t OADDR2;
  uint16_t  RESERVED3;
  __IO uint16_t DATAR;
  uint16_t  RESERVED4;
  __IO uint16_t STAR1;
  uint16_t  RESERVED5;
  __IO uint16_t STAR2;
  uint16_t  RESERVED6;
  __IO uint16_t CKCFGR;
  uint16_t  RESERVED7;
} I2C_TypeDef;

/* Independent WatchDog */
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t PSCR;
  __IO uint32_t RLDR;
  __IO uint32_t STATR;
} IWDG_TypeDef;

/* Power Control */
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t CSR;
} PWR_TypeDef;

/* Reset and Clock Control */
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t CFGR0;
  __IO uint32_t INTR;
  __IO uint32_t HB2PRSTR;
  __IO uint32_t HB1PRSTR;
  __IO uint32_t HBPCENR;
  __IO uint32_t HB2PCENR;
  __IO uint32_t HB1PCENR;
  uint32_t  RESERVED0;
  __IO uint32_t RSTSCKR;
  __IO uint32_t HBRSTR;
  __IO uint32_t CFGR2;
} RCC_TypeDef;

/* Real-Time Clock */
typedef struct
{
  __IO uint16_t CTLRH;
  uint16_t  RESERVED0;
  __IO uint32_t CTLRL;
  __IO uint16_t PSCRH;
  uint16_t  RESERVED1;
  __IO uint16_t PSCRL;
  uint16_t  RESERVED2;
  __IO uint16_t DIVH;
  uint16_t  RESERVED3;
  __IO uint16_t DIVL;
  uint16_t  RESERVED4;
  __IO uint16_t CNTH;
  uint16_t  RESERVED5;
  __IO uint16_t CNTL;
  uint16_t  RESERVED6;
  __IO uint16_t ALRMH;
  uint16_t  RESERVED7;
  __IO uint16_t ALRML;
  uint16_t  RESERVED8;
} RTC_TypeDef;

/* Serial Peripheral Interface */
typedef struct
{
  __IO uint16_t CTLR1;
  uint16_t  RESERVED0;
  __IO uint16_t CTLR2;
  uint16_t  RESERVED1;
  __IO uint16_t STATR;
  uint16_t  RESERVED2;
  __IO uint16_t DATAR;
  uint16_t  RESERVED3;
  __IO uint16_t CRCR;
  uint16_t  RESERVED4;
  __IO uint16_t RCRCR;
  uint16_t  RESERVED5;
  __IO uint16_t TCRCR;
  uint16_t  RESERVED6[5];
  __IO uint16_t HSCR;
  uint16_t  RESERVED9;
} SPI_TypeDef;

/* TIM */
typedef struct
{
  __IO uint16_t CTLR1;
  uint16_t  RESERVED0;
  __IO uint16_t CTLR2;
  uint16_t  RESERVED1;
  __IO uint16_t SMCFGR;
  uint16_t  RESERVED2;
  __IO uint16_t DMAINTENR;
  uint16_t  RESERVED3;
  __IO uint16_t INTFR;
  uint16_t  RESERVED4;
  __IO uint16_t SWEVGR;
  uint16_t  RESERVED5;
  __IO uint16_t CHCTLR1;
  uint16_t  RESERVED6;
  __IO uint16_t CHCTLR2;
  uint16_t  RESERVED7;
  __IO uint16_t CCER;
  uint16_t  RESERVED8;
  union
  {
       __IO uint32_t CNT_TIM4;
      struct
      {
          __IO uint16_t CNT;
          uint16_t      RESERVED9;
      };
  };
  __IO uint16_t PSC;
  uint16_t  RESERVED10;
  union
  {
      __IO uint32_t ATRLR_TIM4;
      struct
      {
          __IO uint16_t ATRLR;
          uint16_t      RESERVED11;
      };
  };
  __IO uint16_t RPTCR;
  uint16_t  RESERVED12;
  union
  {
      __IO uint32_t CH1CVR_TIM4;
      __IO uint32_t CH1CVR;
  };
  union
  {
      __IO uint32_t CH2CVR_TIM4;
      __IO uint32_t CH2CVR;
  };
  union
  {
      __IO uint32_t CH3CVR_TIM4;
      __IO uint32_t CH3CVR;
  };
  union
  {
      __IO uint32_t CH4CVR_TIM4;
      __IO uint32_t CH4CVR;
  };
  __IO uint16_t BDTR;
  uint16_t  RESERVED17;
  __IO uint16_t DMACFGR;
  uint16_t  RESERVED18;
  union
  {
      __IO uint32_t DMAADR_R32;
      struct
      {
          __IO uint16_t DMAADR;
          uint16_t      RESERVED19;
      };
  };
} TIM_TypeDef;

/* Universal Synchronous Asynchronous Receiver Transmitter */
typedef struct
{
  __IO uint16_t STATR;
  uint16_t  RESERVED0;
  __IO uint16_t DATAR;
  uint16_t  RESERVED1;
  __IO uint32_t BRR;
  __IO uint16_t CTLR1;
  uint16_t  RESERVED2;
  __IO uint16_t CTLR2;
  uint16_t  RESERVED3;
  __IO uint16_t CTLR3;
  uint16_t  RESERVED4;
  __IO uint16_t GPR;
  uint16_t  RESERVED5;
  __IO uint16_t CTLR4;
  uint16_t  RESERVED6;
} USART_TypeDef;

/* Window WatchDog */
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t CFGR;
  __IO uint32_t STATR;
} WWDG_TypeDef;

/* PD Registers */
typedef struct
{
    union
    {
        __IO uint32_t USBPD_CONFIG;
        struct
        {
            __IO uint16_t CONFIG;
            __IO uint16_t BMC_CLK_CNT;
        };
    };
    union
    {
        __IO uint32_t USBPD_CONTROL;
        struct
        {
            union
            {
                __IO uint16_t R16_CONTROL;
                struct
                {
                    __IO uint8_t  CONTROL;
                    __IO uint8_t  TX_SEL;
                };
            };
            __IO uint16_t BMC_TX_SZ;
        };
    };
    union
    {
        __IO uint32_t USBPD_STATUS;
        struct
        {
            union
            {
                __IO uint16_t R16_STATUS;
                struct
                {
                    __IO uint8_t  DATA_BUF;
                    __IO uint8_t  STATUS;
                };
            };
            __IO uint16_t BMC_BYTE_CNT;
        };
    };
    union
    {
        __IO uint32_t USBPD_PORT;
        struct
        {
            __IO uint16_t PORT_CC1;
            __IO uint16_t PORT_CC2;
        };
    };
    __IO uint32_t USBPD_DMA;
} USBPD_TypeDef;

/* USBSS Deveice Registers */
typedef struct 
{
  __IO uint8_t  UEP_TX_CFG;             // 0x0
  __IO uint8_t  UEP_TX_CR;              // 0x1
  __IO uint8_t  UEP_TX_SEQ;             // 0x2
  __IO uint8_t  UEP_TX_ST;              // 0x3
  __IO uint8_t  UEP_TX_CHAIN_CR;        // 0x4
  __IO uint8_t  UEP_TX_CHAIN_ST;        // 0x5
  __IO uint16_t UEP_TX_CHAIN_LEN;       // 0x6
  __IO uint8_t  UEP_TX_CHAIN_EXP_NUMP;  // 0x8
  __IO uint8_t  UEP_TX_CHAIN_NUMP;      // 0x9
  __IO uint16_t UEP_TX_DMA_OFS;         // 0xA
  __IO uint32_t UEP_TX_DMA;             // 0xC
}USBSS_EP_TX_TypeDef;

typedef struct 
{
  __IO uint8_t  UEP_RX_CFG;             // 0x0
  __IO uint8_t  UEP_RX_CR;              // 0x1
  __IO uint8_t  UEP_RX_SEQ;             // 0x2
  __IO uint8_t  UEP_RX_ST;              // 0x3
  __IO uint8_t  UEP_RX_CHAIN_CR;        // 0x4
  __IO uint8_t  UEP_RX_CHAIN_ST;        // 0x5
  __IO uint16_t UEP_RX_CHAIN_LEN;       // 0x6
  __IO uint8_t  UEP_RX_CHAIN_MAX_NUMP;  // 0x8
  __IO uint8_t  UEP_RX_CHAIN_NUMP;      // 0x9
  __IO uint16_t UEP_RX_DMA_OFS;         // 0xA
  __IO uint32_t UEP_RX_DMA;             // 0xC
}USBSS_EP_RX_TypeDef;

typedef struct
{
    __IO uint32_t LINK_CFG;          
    __IO uint32_t LINK_CTRL;         
    __IO uint32_t LINK_INT_CTRL;     
    __IO uint32_t LINK_INT_FLAG;     
    __IO uint32_t LINK_STATUS;       
    uint8_t Reserved0[3];           
    __IO uint8_t LINK_ITP_PRE;       
    uint8_t Reserved1[5];           
    __IO uint8_t LINK_U2_INACT_TIMER;
    uint8_t Reserved2[10];          
    __IO uint8_t LINK_U1_WKUP_FILTER;
    uint8_t Reserved3[1];     
    __IO uint16_t LINK_U1_WKUP_TMR;           
    __IO uint8_t LINK_U2_WKUP_FILTER;
    uint8_t Reserved4[3];           
    __IO uint8_t LINK_U3_WKUP_FILTER;
    uint8_t Reserved5[1];  
    __IO uint16_t LINK_U3_WKUP_TMR;     
    __IO uint32_t LINK_U1_EXIT_CFG;   
    __IO uint32_t LINK_U2_EXIT_CFG;   
    __IO uint32_t LINK_U3_EXIT_CFG;       
    __IO uint16_t LINK_ISO_DLY;      
    uint8_t Reserved7[14];          
    __IO uint16_t LINK_LPM_CR;       
    uint8_t Reserved8[2];                 
    __IO uint32_t LINK_LMP_PORT_CAP; 
    __IO uint32_t LINK_LMP_RX_DATA0; 
    __IO uint32_t LINK_LMP_RX_DATA1; 
    __IO uint32_t LINK_LMP_RX_DATA2; 
    __IO uint32_t LINK_LMP_TX_DATA0; 
    __IO uint32_t LINK_LMP_TX_DATA1; 
    __IO uint32_t LINK_LMP_TX_DATA2; 
    __IO uint32_t USB_CONTROL;
    __IO uint32_t USB_STATUS;
    __IO uint32_t USB_ITP;
    __IO uint32_t USB_ITP_ADJ;
    __IO uint16_t UEP_TX_EN;
    __IO uint16_t UEP_RX_EN;
    __IO uint32_t UEP0_TX_CTRL;
    __IO uint32_t UEP0_RX_CTRL;
    __IO uint32_t UEP0_TX_DMA;
    __IO uint32_t UEP0_RX_DMA;
    __IO uint32_t UEP0_TX_DMA_OFS;
    __IO uint32_t UEP0_RX_DMA_OFS;
    uint8_t Reserved9[36]; 
    __IO USBSS_EP_TX_TypeDef EP1_TX;
    __IO USBSS_EP_RX_TypeDef EP1_RX;
    __IO USBSS_EP_TX_TypeDef EP2_TX;
    __IO USBSS_EP_RX_TypeDef EP2_RX;
    __IO USBSS_EP_TX_TypeDef EP3_TX;
    __IO USBSS_EP_RX_TypeDef EP3_RX;
    __IO USBSS_EP_TX_TypeDef EP4_TX;
    __IO USBSS_EP_RX_TypeDef EP4_RX;
}USBSSD_TypeDef;

/* USBHS Deveice Registers */
typedef struct
{
  __IO uint8_t  CONTROL;
  __IO uint8_t  BASE_MODE;
  __IO uint8_t  INT_EN;
  __IO uint8_t  DEV_AD;
  __IO uint8_t  WAKE_CTRL;
  __IO uint8_t  TEST_MODE;
  __IO uint16_t LPM_DATA;

  __IO uint8_t  INT_FG;
  __IO uint8_t  INT_ST;
  __IO uint8_t  MIS_ST;
  uint8_t  RESERVED0;

  __IO uint16_t FRAME_NO;
  __IO uint16_t BUS;

  __IO uint16_t UEP_TX_EN;
  __IO uint16_t UEP_RX_EN;
  __IO uint16_t UEP_TX_TOG_AUTO;
  __IO uint16_t UEP_RX_TOG_AUTO;

