openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
  __IO uint8_t  UEP_TX_BURST;
  __IO uint8_t  UEP_TX_BURST_MODE;
  __IO uint8_t  UEP_RX_BURST;
  __IO uint8_t  UEP_RX_RES_MODE;

  __IO uint32_t UEP_AF_MODE;
  __IO uint32_t UEP0_DMA;
  __IO uint32_t UEP1_RX_DMA;
  __IO uint32_t UEP2_RX_DMA;
  __IO uint32_t UEP3_RX_DMA;
  __IO uint32_t UEP4_RX_DMA;
  __IO uint32_t UEP5_RX_DMA;
  __IO uint32_t UEP6_RX_DMA;
  __IO uint32_t UEP7_RX_DMA;
  __IO uint32_t UEP1_TX_DMA;
  __IO uint32_t UEP2_TX_DMA;
  __IO uint32_t UEP3_TX_DMA;
  __IO uint32_t UEP4_TX_DMA;
  __IO uint32_t UEP5_TX_DMA;
  __IO uint32_t UEP6_TX_DMA;
  __IO uint32_t UEP7_TX_DMA;
  __IO uint32_t UEP0_MAX_LEN;
  __IO uint32_t UEP1_MAX_LEN;
  __IO uint32_t UEP2_MAX_LEN;
  __IO uint32_t UEP3_MAX_LEN;
  __IO uint32_t UEP4_MAX_LEN;
  __IO uint32_t UEP5_MAX_LEN;
  __IO uint32_t UEP6_MAX_LEN;
  __IO uint32_t UEP7_MAX_LEN;

  __IO uint16_t UEP0_RX_LEN;
  uint16_t RESERVED1;
  __IO uint16_t UEP1_RX_LEN;
  __IO uint16_t UEP1_RX_SIZE;
  __IO uint16_t UEP2_RX_LEN;
  __IO uint16_t UEP2_RX_SIZE;
  __IO uint16_t UEP3_RX_LEN;
  __IO uint16_t UEP3_RX_SIZE;
  __IO uint16_t UEP4_RX_LEN;
  __IO uint16_t UEP4_RX_SIZE;
  __IO uint16_t UEP5_RX_LEN;
  __IO uint16_t UEP5_RX_SIZE;
  __IO uint16_t UEP6_RX_LEN;
  __IO uint16_t UEP6_RX_SIZE;
  __IO uint16_t UEP7_RX_LEN;
  __IO uint16_t UEP7_RX_SIZE;
  __IO uint16_t UEP0_TX_LEN;
  __IO uint8_t  UEP0_TX_CTRL;
  __IO uint8_t  UEP0_RX_CTRL;

  __IO uint16_t UEP1_TX_LEN;
  __IO uint8_t  UEP1_TX_CTRL;
  __IO uint8_t  UEP1_RX_CTRL;
  __IO uint16_t UEP2_TX_LEN;
  __IO uint8_t  UEP2_TX_CTRL;
  __IO uint8_t  UEP2_RX_CTRL;
  __IO uint16_t UEP3_TX_LEN;
  __IO uint8_t  UEP3_TX_CTRL;
  __IO uint8_t  UEP3_RX_CTRL;
  __IO uint16_t UEP4_TX_LEN;
  __IO uint8_t  UEP4_TX_CTRL;
  __IO uint8_t  UEP4_RX_CTRL;
  __IO uint16_t UEP5_TX_LEN;
  __IO uint8_t  UEP5_TX_CTRL;
  __IO uint8_t  UEP5_RX_CTRL;
  __IO uint16_t UEP6_TX_LEN;
  __IO uint8_t  UEP6_TX_CTRL;
  __IO uint8_t  UEP6_RX_CTRL;
  __IO uint16_t UEP7_TX_LEN;
  __IO uint8_t  UEP7_TX_CTRL;
  __IO uint8_t  UEP7_RX_CTRL;

  __IO uint16_t UEP_TX_ISO;
  __IO uint16_t UEP_RX_ISO;

  __IO uint32_t UEP1_RX_FIFO;
  __IO uint32_t UEP2_RX_FIFO;
  __IO uint32_t UEP3_RX_FIFO;
  __IO uint32_t UEP4_RX_FIFO;
  __IO uint32_t UEP5_RX_FIFO;
  __IO uint32_t UEP6_RX_FIFO;
  __IO uint32_t UEP7_RX_FIFO;
  __IO uint32_t UEP1_TX_FIFO;
  __IO uint32_t UEP2_TX_FIFO;
  __IO uint32_t UEP3_TX_FIFO;
  __IO uint32_t UEP4_TX_FIFO;
  __IO uint32_t UEP5_TX_FIFO;
  __IO uint32_t UEP6_TX_FIFO;
  __IO uint32_t UEP7_TX_FIFO;
} USBHSD_TypeDef;

/* USBHS Host Registers */
typedef struct  __attribute__((packed))
{
  __IO uint8_t  CFG;
  uint8_t  RESERVED0;
  __IO uint8_t  INT_EN;
  __IO uint8_t  DEV_ADDR;
  __IO uint32_t CONTROL;

  __IO uint8_t  INT_FLAG;
  __IO uint8_t  INT_ST;
  __IO uint8_t  MIS_ST;
  uint8_t  RESERVED1;

  __IO uint32_t LPM;
  __IO uint32_t SPLIT;
  __IO uint32_t FRAME;
  __IO uint32_t TX_LEN;
  __IO uint32_t RX_LEN;
  __IO uint32_t RX_MAX_LEN;
  __IO uint32_t RX_DMA;
  __IO uint32_t TX_DMA;
  __IO uint32_t PORT_CTRL;
  __IO uint8_t  PORT_CFG;
  uint8_t  RESERVED2;
  __IO uint8_t  PORT_INT_EN;
  __IO uint8_t  PORT_TEST_CT;

  __IO uint16_t PORT_STATUS;
  __IO uint8_t  PORT_STATUS_CHG;
  uint8_t  RESERVED3[5];
  __IO uint32_t ROOT_BC_CTRL;
} USBHSH_TypeDef;



/* USBHS Deveice Registers */
typedef struct
{
  __IO uint32_t  HSI_CAL_CR;
} USBHSI_TypeDef;
/* Enhanced Registers */
typedef struct
{
  __IO uint32_t EXTEN_CTR;
} EXTEN_TypeDef;

/* Peripheral memory map */
#define FLASH_BASE            ((uint32_t)0x08000000) /* FLASH base address in the alias region */
#define SRAM_BASE             ((uint32_t)0x20000000) /* SRAM base address in the alias region */
#define PERIPH_BASE           ((uint32_t)0x40000000) /* Peripheral base address in the alias region */

#define HBPERIPH_BASE         (PERIPH_BASE)

#define TIM2_BASE             (HBPERIPH_BASE + 0x00000)
#define TIM3_BASE             (HBPERIPH_BASE + 0x00400)
#define TIM4_BASE             (HBPERIPH_BASE + 0x00800)
#define RTC_BASE              (HBPERIPH_BASE + 0x02800)
#define WWDG_BASE             (HBPERIPH_BASE + 0x02C00)
#define IWDG_BASE             (HBPERIPH_BASE + 0x03000)
#define SPI2_BASE             (HBPERIPH_BASE + 0x03800)
#define SPI3_BASE             (HBPERIPH_BASE + 0x03C00)
#define USART2_BASE           (HBPERIPH_BASE + 0x04400)
#define USART3_BASE           (HBPERIPH_BASE + 0x04800)
#define USART4_BASE           (HBPERIPH_BASE + 0x04C00)
#define I2C1_BASE             (HBPERIPH_BASE + 0x05400)
#define I2C2_BASE             (HBPERIPH_BASE + 0x05800)
#define PWR_BASE              (HBPERIPH_BASE + 0x07000)

#define AFIO_BASE             (HBPERIPH_BASE + 0x10000)
#define EXTI_BASE             (HBPERIPH_BASE + 0x10400)
#define GPIOA_BASE            (HBPERIPH_BASE + 0x10800)
#define GPIOB_BASE            (HBPERIPH_BASE + 0x10C00)
#define GPIOC_BASE            (HBPERIPH_BASE + 0x11000)
#define GPIOD_BASE            (HBPERIPH_BASE + 0x11400)
#define ADC1_BASE             (HBPERIPH_BASE + 0x12400)
#define ADC2_BASE             (HBPERIPH_BASE + 0x12800)
#define TIM1_BASE             (HBPERIPH_BASE + 0x12C00)
#define SPI1_BASE             (HBPERIPH_BASE + 0x13000)
#define USART1_BASE           (HBPERIPH_BASE + 0x13800)
#define ADC3_BASE             (HBPERIPH_BASE + 0x13C00)
#define ADC4_BASE             (HBPERIPH_BASE + 0x14000)

#define DMA1_BASE             (HBPERIPH_BASE + 0x20000)
#define DMA1_Channel1_BASE    (HBPERIPH_BASE + 0x20008)
#define DMA1_Channel2_BASE    (HBPERIPH_BASE + 0x2001C)
#define DMA1_Channel3_BASE    (HBPERIPH_BASE + 0x20030)
#define DMA1_Channel4_BASE    (HBPERIPH_BASE + 0x20044)
#define DMA1_Channel5_BASE    (HBPERIPH_BASE + 0x20058)
#define DMA1_Channel6_BASE    (HBPERIPH_BASE + 0x2006C)
#define DMA1_Channel7_BASE    (HBPERIPH_BASE + 0x20080)
#define DMA1_Channel8_BASE    (HBPERIPH_BASE + 0x20094)
#define DMA1_Channel9_BASE    (HBPERIPH_BASE + 0x200A8)
#define DMA1_Channel10_BASE   (HBPERIPH_BASE + 0x200BC)
#define DMA1_Channel11_BASE   (HBPERIPH_BASE + 0x200D0)

#define DMA1_EXTEN_BASE       (HBPERIPH_BASE + 0x200E4)
#define RCC_BASE              (HBPERIPH_BASE + 0x21000)
#define FLASH_R_BASE          (HBPERIPH_BASE + 0x22000)
#define CRC_BASE              (HBPERIPH_BASE + 0x23000)
#define ARGB_BASE             (HBPERIPH_BASE + 0x25000)
#define USBPD_BASE            (HBPERIPH_BASE + 0x24400)

#define USBHS_BASE            (HBPERIPH_BASE + 0x30000)
#define USBHSD_BASE           (USBHS_BASE)
#define USBHSH_BASE           (USBHS_BASE + 0x100)
#define USBHSI_BASE           (USBHS_BASE + 0x200)

