openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
#define USBSS_BASE            (HBPERIPH_BASE + 0x38000)

#define OB_BASE               ((uint32_t)0x1FFFF800)

#define EXTEN_BASE            ((uint32_t)0x400220C0)

/* Peripheral declaration */
#define TIM2                  ((TIM_TypeDef *) TIM2_BASE)
#define TIM3                  ((TIM_TypeDef *) TIM3_BASE)
#define TIM4                  ((TIM_TypeDef *) TIM4_BASE)
#define RTC                   ((RTC_TypeDef *) RTC_BASE)
#define WWDG                  ((WWDG_TypeDef *) WWDG_BASE)
#define IWDG                  ((IWDG_TypeDef *) IWDG_BASE)
#define SPI2                  ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                  ((SPI_TypeDef *) SPI3_BASE)
#define USART2                ((USART_TypeDef *) USART2_BASE)
#define USART3                ((USART_TypeDef *) USART3_BASE)
#define USART4                ((USART_TypeDef *) USART4_BASE)
#define I2C1                  ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                  ((I2C_TypeDef *) I2C2_BASE)
#define PWR                   ((PWR_TypeDef *) PWR_BASE)
#define AFIO                  ((AFIO_TypeDef *) AFIO_BASE)
#define EXTI                  ((EXTI_TypeDef *) EXTI_BASE)
#define GPIOA                 ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB                 ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC                 ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD                 ((GPIO_TypeDef *) GPIOD_BASE)
#define ADC1                  ((ADC_TypeDef *) ADC1_BASE)
#define ADC2                  ((ADC_TypeDef *) ADC2_BASE)
#define TIM1                  ((TIM_TypeDef *) TIM1_BASE)
#define SPI1                  ((SPI_TypeDef *) SPI1_BASE)
#define USART1                ((USART_TypeDef *) USART1_BASE)
#define ADC3                  ((ADC_TypeDef *) ADC3_BASE)
#define ADC4                  ((ADC_TypeDef *) ADC4_BASE)
#define DMA1                  ((DMA_TypeDef *) DMA1_BASE)
#define DMA1_EXTEN            ((DMA_TypeDef *) DMA1_EXTEN_BASE)
#define DMA1_Channel1         ((DMA_Channel_TypeDef *) DMA1_Channel1_BASE)
#define DMA1_Channel2         ((DMA_Channel_TypeDef *) DMA1_Channel2_BASE)
#define DMA1_Channel3         ((DMA_Channel_TypeDef *) DMA1_Channel3_BASE)
#define DMA1_Channel4         ((DMA_Channel_TypeDef *) DMA1_Channel4_BASE)
#define DMA1_Channel5         ((DMA_Channel_TypeDef *) DMA1_Channel5_BASE)
#define DMA1_Channel6         ((DMA_Channel_TypeDef *) DMA1_Channel6_BASE)
#define DMA1_Channel7         ((DMA_Channel_TypeDef *) DMA1_Channel7_BASE)
#define DMA1_Channel8         ((DMA_Channel_TypeDef *) DMA1_Channel8_BASE)
#define DMA1_Channel9         ((DMA_Channel_TypeDef *) DMA1_Channel9_BASE)
#define DMA1_Channel10        ((DMA_Channel_TypeDef *) DMA1_Channel10_BASE)
#define DMA1_Channel11        ((DMA_Channel_TypeDef *) DMA1_Channel11_BASE)

#define RCC                   ((RCC_TypeDef *) RCC_BASE)
#define FLASH                 ((FLASH_TypeDef *) FLASH_R_BASE)
#define CRC                   ((CRC_TypeDef *) CRC_BASE)
#define ARGB                  ((ARGB_TypeDef *) ARGB_BASE)
#define USBPD                 ((USBPD_TypeDef *) USBPD_BASE)

#define USBHSD                ((USBHSD_TypeDef *) USBHSD_BASE)
#define USBHSH                ((USBHSH_TypeDef *) USBHSH_BASE)
#define USBSSD                ((USBSSD_TypeDef *) USBSS_BASE)
#define USBHSI                ((USBHSI_TypeDef *) USBHSI_BASE)

#define OB                    ((OB_TypeDef *) OB_BASE)
#define EXTEN                 ((EXTEN_TypeDef *) EXTEN_BASE)

/******************************************************************************/
/*                         Peripheral Registers Bits Definition               */
/******************************************************************************/

/******************************************************************************/
/*                        Analog to Digital Converter                         */
/******************************************************************************/

/********************  Bit definition for ADC_STATR register  ********************/
#define  ADC_AWD                                     ((uint8_t)0x01)               /* Analog watchdog flag */
#define  ADC_EOC                                     ((uint8_t)0x02)               /* End of conversion */
#define  ADC_JEOC                                    ((uint8_t)0x04)               /* Injected channel end of conversion */
#define  ADC_JSTRT                                   ((uint8_t)0x08)               /* Injected channel Start flag */
#define  ADC_STRT                                    ((uint8_t)0x10)               /* Regular channel Start flag */
#define  ADC_RSTF                                    ((uint16_t)0x8000)            /* Reset flag */
#define  ADC_DELTA                                   ((uint32_t)0x07FF0000)        /* ADC_DELTA[10:0] bits */

/*******************  Bit definition for ADC_CTLR1 register  ********************/
#define  ADC_AWDCH                                   ((uint32_t)0x0000001F)        /* AWDCH[4:0] bits (Analog watchdog channel select bits) */
#define  ADC_AWDCH_0                                 ((uint32_t)0x00000001)        /* Bit 0 */
#define  ADC_AWDCH_1                                 ((uint32_t)0x00000002)        /* Bit 1 */
#define  ADC_AWDCH_2                                 ((uint32_t)0x00000004)        /* Bit 2 */
#define  ADC_AWDCH_3                                 ((uint32_t)0x00000008)        /* Bit 3 */
#define  ADC_AWDCH_4                                 ((uint32_t)0x00000010)        /* Bit 4 */

#define  ADC_EOCIE                                   ((uint32_t)0x00000020)        /* Interrupt enable for EOC */
#define  ADC_AWDIE                                   ((uint32_t)0x00000040)        /* Analog Watchdog interrupt enable */
#define  ADC_JEOCIE                                  ((uint32_t)0x00000080)        /* Interrupt enable for injected channels */
#define  ADC_SCAN                                    ((uint32_t)0x00000100)        /* Scan mode */
#define  ADC_AWDSGL                                  ((uint32_t)0x00000200)        /* Enable the watchdog on a single channel in scan mode */
#define  ADC_JAUTO                                   ((uint32_t)0x00000400)        /* Automatic injected group conversion */
#define  ADC_DISCEN                                  ((uint32_t)0x00000800)        /* Discontinuous mode on regular channels */
#define  ADC_JDISCEN                                 ((uint32_t)0x00001000)        /* Discontinuous mode on injected channels */

