openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
#define  ADC_DISCNUM                                 ((uint32_t)0x0000E000)        /* DISCNUM[2:0] bits (Discontinuous mode channel count) */
#define  ADC_DISCNUM_0                               ((uint32_t)0x00002000)        /* Bit 0 */
#define  ADC_DISCNUM_1                               ((uint32_t)0x00004000)        /* Bit 1 */
#define  ADC_DISCNUM_2                               ((uint32_t)0x00008000)        /* Bit 2 */

#define  ADC_DUALMOD                                 ((uint32_t)0x000F0000)        /* DUALMOD[3:0] bits (Dual mode selection) */
#define  ADC_DUALMOD_0                               ((uint32_t)0x00010000)        /* Bit 0 */
#define  ADC_DUALMOD_1                               ((uint32_t)0x00020000)        /* Bit 1 */
#define  ADC_DUALMOD_2                               ((uint32_t)0x00040000)        /* Bit 2 */
#define  ADC_DUALMOD_3                               ((uint32_t)0x00080000)        /* Bit 3 */

#define  ADC_JAWDEN                                  ((uint32_t)0x00400000)        /* Analog watchdog enable on injected channels */
#define  ADC_AWDEN                                   ((uint32_t)0x00800000)        /* Analog watchdog enable on regular channels */

#define  ADC_BUFEN                                   ((uint32_t)0x04000000)        
 
#define  ADC_AWDRST                                  ((uint32_t)0x20000000) 
#define  ADC_ANARST                                  ((uint32_t)0x40000000) 
#define  ADC_SWPRE                                   ((uint32_t)0x80000000) 
     
/*******************  Bit definition for ADC_CTLR2 register  ********************/
#define  ADC_ADON                                    ((uint32_t)0x00000001)        /* A/D Converter ON / OFF */
#define  ADC_CONT                                    ((uint32_t)0x00000002)        /* Continuous Conversion */
#define  ADC_CAL                                     ((uint32_t)0x00000004)        /* A/D Calibration */
#define  ADC_RSTCAL                                  ((uint32_t)0x00000008)        /* Reset Calibration */

#define  ADC_CALVOL                                  ((uint32_t)0x00000030)        /* ADC_CALVOL[2:0] bits */
#define  ADC_CALVOL_0                                ((uint32_t)0x00000010) 
#define  ADC_CALVOL_1                                ((uint32_t)0x00000020) 

#define  ADC_CALVOL0                                 ((uint32_t)0x00000000) 
#define  ADC_CALVOL1                                 ((uint32_t)0x00000010) 
#define  ADC_CALVOL2                                 ((uint32_t)0x00000020) 
#define  ADC_CALVOL3                                 ((uint32_t)0x00000030) 

#define  ADC_CALOUT                                  ((uint32_t)0x00000040)

#define  ADC_DMA                                     ((uint32_t)0x00000100)        /* Direct Memory access mode */
#define  ADC_ALIGN                                   ((uint32_t)0x00000800)        /* Data Alignment */

#define  ADC_JEXTSEL                                 ((uint32_t)0x00007000)        /* JEXTSEL[2:0] bits (External event select for injected group) */
#define  ADC_JEXTSEL_0                               ((uint32_t)0x00001000)        /* Bit 0 */
#define  ADC_JEXTSEL_1                               ((uint32_t)0x00002000)        /* Bit 1 */
#define  ADC_JEXTSEL_2                               ((uint32_t)0x00004000)        /* Bit 2 */

#define  ADC_JEXTTRIG                                ((uint32_t)0x00008000)        /* External Trigger Conversion mode for injected channels */

#define  ADC_EXTSEL                                  ((uint32_t)0x000E0000)        /* EXTSEL[2:0] bits (External Event Select for regular group) */
#define  ADC_EXTSEL_0                                ((uint32_t)0x00020000)        /* Bit 0 */
#define  ADC_EXTSEL_1                                ((uint32_t)0x00040000)        /* Bit 1 */
#define  ADC_EXTSEL_2                                ((uint32_t)0x00080000)        /* Bit 2 */

#define  ADC_EXTTRIG                                 ((uint32_t)0x00100000)        /* External Trigger Conversion mode for regular channels */
#define  ADC_JSWSTART                                ((uint32_t)0x00200000)        /* Start Conversion of injected channels */
#define  ADC_SWSTART                                 ((uint32_t)0x00400000)        /* Start Conversion of regular channels */
#define  ADC_VREFE                                   ((uint32_t)0x00800000)        /* VREFINT Enable */

#define  ADC_ENHANCE                                 ((uint32_t)0x03000000)  
#define  ADC_ENHANCE_0                               ((uint32_t)0x01000000) 
#define  ADC_ENHANCE_1                               ((uint32_t)0x02000000) 

#define  ADC_ENHANCE_12BitMODE                       ((uint32_t)0x00000000)  
#define  ADC_ENHANCE_13BitMODE                       ((uint32_t)0x01000000)  
#define  ADC_ENHANCE_14BitMODE                       ((uint32_t)0x02000000)  
#define  ADC_ENHANCE_15BitMODE                       ((uint32_t)0x03000000)  

#define  ADC_REGUCON                                 ((uint32_t)0x04000000)  
#define  ADC_INJECON                                 ((uint32_t)0x08000000) 

#define  ADC_CONTS                                   ((uint32_t)0x30000000)       /* ADC_CONTS[1:0] bits */
#define  ADC_CONTS_0                                 ((uint32_t)0x10000000) 
#define  ADC_CONTS_1                                 ((uint32_t)0x20000000) 

#define  ADC_CONTS_ADC1                              ((uint32_t)0x00000000) 
#define  ADC_CONTS_ADC2                              ((uint32_t)0x10000000) 
#define  ADC_CONTS_ADC3                              ((uint32_t)0x20000000) 
#define  ADC_CONTS_ADC4                              ((uint32_t)0x30000000) 

/******************  Bit definition for ADC_SAMPTR1 register  *******************/
#define  ADC_SMP10                                   ((uint32_t)0x00000007)        /* SMP10[2:0] bits (Channel 10 Sample time selection) */
#define  ADC_SMP10_0                                 ((uint32_t)0x00000001)        /* Bit 0 */
#define  ADC_SMP10_1                                 ((uint32_t)0x00000002)        /* Bit 1 */
#define  ADC_SMP10_2                                 ((uint32_t)0x00000004)        /* Bit 2 */

#define  ADC_SMP11                                   ((uint32_t)0x00000038)        /* SMP11[2:0] bits (Channel 11 Sample time selection) */
#define  ADC_SMP11_0                                 ((uint32_t)0x00000008)        /* Bit 0 */
#define  ADC_SMP11_1                                 ((uint32_t)0x00000010)        /* Bit 1 */
#define  ADC_SMP11_2                                 ((uint32_t)0x00000020)        /* Bit 2 */

#define  ADC_SMP12                                   ((uint32_t)0x000001C0)        /* SMP12[2:0] bits (Channel 12 Sample time selection) */
#define  ADC_SMP12_0                                 ((uint32_t)0x00000040)        /* Bit 0 */
#define  ADC_SMP12_1                                 ((uint32_t)0x00000080)        /* Bit 1 */
#define  ADC_SMP12_2                                 ((uint32_t)0x00000100)        /* Bit 2 */

#define  ADC_SMP13                                   ((uint32_t)0x00000E00)        /* SMP13[2:0] bits (Channel 13 Sample time selection) */
#define  ADC_SMP13_0                                 ((uint32_t)0x00000200)        /* Bit 0 */
#define  ADC_SMP13_1                                 ((uint32_t)0x00000400)        /* Bit 1 */
#define  ADC_SMP13_2                                 ((uint32_t)0x00000800)        /* Bit 2 */

/******************  Bit definition for ADC_SAMPTR2 register  *******************/
#define  ADC_SMP0                                    ((uint32_t)0x00000007)        /* SMP0[2:0] bits (Channel 0 Sample time selection) */
#define  ADC_SMP0_0                                  ((uint32_t)0x00000001)        /* Bit 0 */
#define  ADC_SMP0_1                                  ((uint32_t)0x00000002)        /* Bit 1 */
#define  ADC_SMP0_2                                  ((uint32_t)0x00000004)        /* Bit 2 */

#define  ADC_SMP1                                    ((uint32_t)0x00000038)        /* SMP1[2:0] bits (Channel 1 Sample time selection) */
#define  ADC_SMP1_0                                  ((uint32_t)0x00000008)        /* Bit 0 */
#define  ADC_SMP1_1                                  ((uint32_t)0x00000010)        /* Bit 1 */
#define  ADC_SMP1_2                                  ((uint32_t)0x00000020)        /* Bit 2 */

