openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
#define  ADC_SQ4                                     ((uint32_t)0x000F8000)        /* SQ4[4:0] bits (4th conversion in regular sequence) */
#define  ADC_SQ4_0                                   ((uint32_t)0x00008000)        /* Bit 0 */
#define  ADC_SQ4_1                                   ((uint32_t)0x00010000)        /* Bit 1 */
#define  ADC_SQ4_2                                   ((uint32_t)0x00020000)        /* Bit 2 */
#define  ADC_SQ4_3                                   ((uint32_t)0x00040000)        /* Bit 3 */
#define  ADC_SQ4_4                                   ((uint32_t)0x00080000)        /* Bit 4 */

#define  ADC_SQ5                                     ((uint32_t)0x01F00000)        /* SQ5[4:0] bits (5th conversion in regular sequence) */
#define  ADC_SQ5_0                                   ((uint32_t)0x00100000)        /* Bit 0 */
#define  ADC_SQ5_1                                   ((uint32_t)0x00200000)        /* Bit 1 */
#define  ADC_SQ5_2                                   ((uint32_t)0x00400000)        /* Bit 2 */
#define  ADC_SQ5_3                                   ((uint32_t)0x00800000)        /* Bit 3 */
#define  ADC_SQ5_4                                   ((uint32_t)0x01000000)        /* Bit 4 */

#define  ADC_SQ6                                     ((uint32_t)0x3E000000)        /* SQ6[4:0] bits (6th conversion in regular sequence) */
#define  ADC_SQ6_0                                   ((uint32_t)0x02000000)        /* Bit 0 */
#define  ADC_SQ6_1                                   ((uint32_t)0x04000000)        /* Bit 1 */
#define  ADC_SQ6_2                                   ((uint32_t)0x08000000)        /* Bit 2 */
#define  ADC_SQ6_3                                   ((uint32_t)0x10000000)        /* Bit 3 */
#define  ADC_SQ6_4                                   ((uint32_t)0x20000000)        /* Bit 4 */

/*******************  Bit definition for ADC_ISQR register  *******************/
#define  ADC_JSQ1                                    ((uint32_t)0x0000001F)        /* JSQ1[4:0] bits (1st conversion in injected sequence) */  
#define  ADC_JSQ1_0                                  ((uint32_t)0x00000001)        /* Bit 0 */
#define  ADC_JSQ1_1                                  ((uint32_t)0x00000002)        /* Bit 1 */
#define  ADC_JSQ1_2                                  ((uint32_t)0x00000004)        /* Bit 2 */
#define  ADC_JSQ1_3                                  ((uint32_t)0x00000008)        /* Bit 3 */
#define  ADC_JSQ1_4                                  ((uint32_t)0x00000010)        /* Bit 4 */

#define  ADC_JSQ2                                    ((uint32_t)0x000003E0)        /* JSQ2[4:0] bits (2nd conversion in injected sequence) */
#define  ADC_JSQ2_0                                  ((uint32_t)0x00000020)        /* Bit 0 */
#define  ADC_JSQ2_1                                  ((uint32_t)0x00000040)        /* Bit 1 */
#define  ADC_JSQ2_2                                  ((uint32_t)0x00000080)        /* Bit 2 */
#define  ADC_JSQ2_3                                  ((uint32_t)0x00000100)        /* Bit 3 */
#define  ADC_JSQ2_4                                  ((uint32_t)0x00000200)        /* Bit 4 */

#define  ADC_JSQ3                                    ((uint32_t)0x00007C00)        /* JSQ3[4:0] bits (3rd conversion in injected sequence) */
#define  ADC_JSQ3_0                                  ((uint32_t)0x00000400)        /* Bit 0 */
#define  ADC_JSQ3_1                                  ((uint32_t)0x00000800)        /* Bit 1 */
#define  ADC_JSQ3_2                                  ((uint32_t)0x00001000)        /* Bit 2 */
#define  ADC_JSQ3_3                                  ((uint32_t)0x00002000)        /* Bit 3 */
#define  ADC_JSQ3_4                                  ((uint32_t)0x00004000)        /* Bit 4 */

#define  ADC_JSQ4                                    ((uint32_t)0x000F8000)        /* JSQ4[4:0] bits (4th conversion in injected sequence) */
#define  ADC_JSQ4_0                                  ((uint32_t)0x00008000)        /* Bit 0 */
#define  ADC_JSQ4_1                                  ((uint32_t)0x00010000)        /* Bit 1 */
#define  ADC_JSQ4_2                                  ((uint32_t)0x00020000)        /* Bit 2 */
#define  ADC_JSQ4_3                                  ((uint32_t)0x00040000)        /* Bit 3 */
#define  ADC_JSQ4_4                                  ((uint32_t)0x00080000)        /* Bit 4 */

#define  ADC_JL                                      ((uint32_t)0x00300000)        /* JL[1:0] bits (Injected Sequence length) */
#define  ADC_JL_0                                    ((uint32_t)0x00100000)        /* Bit 0 */
#define  ADC_JL_1                                    ((uint32_t)0x00200000)        /* Bit 1 */

/*******************  Bit definition for ADC_IDATAR1 register  *******************/
#define  ADC_IDATAR1_JDATA                           ((uint16_t)0xFFFF)            /* Injected data */

/*******************  Bit definition for ADC_IDATAR2 register  *******************/
#define  ADC_IDATAR2_JDATA                           ((uint16_t)0xFFFF)            /* Injected data */

/*******************  Bit definition for ADC_IDATAR3 register  *******************/
#define  ADC_IDATAR3_JDATA                           ((uint16_t)0xFFFF)            /* Injected data */

/*******************  Bit definition for ADC_IDATAR4 register  *******************/
#define  ADC_IDATAR4_JDATA                           ((uint16_t)0xFFFF)            /* Injected data */

/********************  Bit definition for ADC_RDATAR register  ********************/
#define  ADC_RDATAR_DATA                             ((uint32_t)0x0000FFFF)        /* Regular data */
#define  ADC_RDATAR_ADC2DATA                         ((uint32_t)0xFFFF0000)        /* ADC2 data */

/********************  Bit definition for ADC_SMPMD register  ********************/
#define  ADC_SMPMD0                                  ((uint32_t)0x00000001)        /* SMPMD0 */
#define  ADC_SMPMD1                                  ((uint32_t)0x00000002)        /* SMPMD1 */
#define  ADC_SMPMD2                                  ((uint32_t)0x00000004)        /* SMPMD2 */
#define  ADC_SMPMD3                                  ((uint32_t)0x00000008)        /* SMPMD3 */
#define  ADC_SMPMD4                                  ((uint32_t)0x00000010)        /* SMPMD4 */
#define  ADC_SMPMD5                                  ((uint32_t)0x00000020)        /* SMPMD5 */
#define  ADC_SMPMD6                                  ((uint32_t)0x00000040)        /* SMPMD6 */
#define  ADC_SMPMD7                                  ((uint32_t)0x00000080)        /* SMPMD7 */
#define  ADC_SMPMD8                                  ((uint32_t)0x00000100)        /* SMPMD8 */
#define  ADC_SMPMD9                                  ((uint32_t)0x00000200)        /* SMPMD9 */
#define  ADC_SMPMD10                                 ((uint32_t)0x00000400)        /* SMPMD10 */
#define  ADC_SMPMD11                                 ((uint32_t)0x00000800)        /* SMPMD11 */
#define  ADC_SMPMD12                                 ((uint32_t)0x00001000)        /* SMPMD12 */
#define  ADC_SMPMD13                                 ((uint32_t)0x00002000)        /* SMPMD13 */

/********************  Bit definition for ADC_UDP register  ********************/
#define  ADC_SMPUDP                                  ((uint32_t)0x000000FF)        /* ADC_SMPUDP[7:0] bits */
#define  ADC_SMPCAL                                  ((uint32_t)0x0000FF00)        /* ADC_SMPCAL[7:0] bits */

/********************  Bit definition for ADC_CONCFG register  ********************/
#define  ADC_REGUDLY                                 ((uint32_t)0x0000003F)        /* ADC_REGUDLY[5:0] bits */
#define  ADC_INJEDLY                                 ((uint32_t)0x00003F00)        /* ADC_INJEDLY[5:0] bits */

#define  ADC_INJESEQ                                 ((uint32_t)0x00030000)        /* ADC_INJESEQ[1:0] bits */
#define  ADC_INJESEQ_1                               ((uint32_t)0x00010000) 
#define  ADC_INJESEQ_2                               ((uint32_t)0x00020000) 

