openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
#define  DMA_CFGR1_PSIZE                             ((uint16_t)0x0300)            /* PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CFGR1_PSIZE_0                           ((uint16_t)0x0100)            /* Bit 0 */
#define  DMA_CFGR1_PSIZE_1                           ((uint16_t)0x0200)            /* Bit 1 */

#define  DMA_CFGR1_MSIZE                             ((uint16_t)0x0C00)            /* MSIZE[1:0] bits (Memory size) */
#define  DMA_CFGR1_MSIZE_0                           ((uint16_t)0x0400)            /* Bit 0 */
#define  DMA_CFGR1_MSIZE_1                           ((uint16_t)0x0800)            /* Bit 1 */

#define  DMA_CFGR1_PL                                ((uint16_t)0x3000)            /* PL[1:0] bits(Channel Priority level) */
#define  DMA_CFGR1_PL_0                              ((uint16_t)0x1000)            /* Bit 0 */
#define  DMA_CFGR1_PL_1                              ((uint16_t)0x2000)            /* Bit 1 */

#define  DMA_CFGR1_MEM2MEM                           ((uint16_t)0x4000)            /* Memory to memory mode */
#define  DMA_CFGR1_DOUBLE_MODE                       ((uint16_t)0x8000) 
#define  DMA_CFGR1_FLAG_CUR_MEM                      ((uint32_t)0x00010000) 

/*******************  Bit definition for DMA_CFGR2 register  *******************/
#define  DMA_CFGR2_EN                                ((uint16_t)0x0001)            /* Channel enable */
#define  DMA_CFGR2_TCIE                              ((uint16_t)0x0002)            /* Transfer complete interrupt enable */
#define  DMA_CFGR2_HTIE                              ((uint16_t)0x0004)            /* Half Transfer interrupt enable */
#define  DMA_CFGR2_TEIE                              ((uint16_t)0x0008)            /* Transfer error interrupt enable */
#define  DMA_CFGR2_DIR                               ((uint16_t)0x0010)            /* Data transfer direction */
#define  DMA_CFGR2_CIRC                              ((uint16_t)0x0020)            /* Circular mode */
#define  DMA_CFGR2_PINC                              ((uint16_t)0x0040)            /* Peripheral increment mode */
#define  DMA_CFGR2_MINC                              ((uint16_t)0x0080)            /* Memory increment mode */

#define  DMA_CFGR2_PSIZE                             ((uint16_t)0x0300)            /* PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CFGR2_PSIZE_0                           ((uint16_t)0x0100)            /* Bit 0 */
#define  DMA_CFGR2_PSIZE_1                           ((uint16_t)0x0200)            /* Bit 1 */

#define  DMA_CFGR2_MSIZE                             ((uint16_t)0x0C00)            /* MSIZE[1:0] bits (Memory size) */
#define  DMA_CFGR2_MSIZE_0                           ((uint16_t)0x0400)            /* Bit 0 */
#define  DMA_CFGR2_MSIZE_1                           ((uint16_t)0x0800)            /* Bit 1 */

#define  DMA_CFGR2_PL                                ((uint16_t)0x3000)            /* PL[1:0] bits (Channel Priority level) */
#define  DMA_CFGR2_PL_0                              ((uint16_t)0x1000)            /* Bit 0 */
#define  DMA_CFGR2_PL_1                              ((uint16_t)0x2000)            /* Bit 1 */

#define  DMA_CFGR2_MEM2MEM                           ((uint16_t)0x4000)            /* Memory to memory mode */
#define  DMA_CFGR2_DOUBLE_MODE                       ((uint16_t)0x8000) 
#define  DMA_CFGR2_FLAG_CUR_MEM                      ((uint32_t)0x00010000) 

/*******************  Bit definition for DMA_CFGR3 register  *******************/
#define  DMA_CFGR3_EN                                ((uint16_t)0x0001)            /* Channel enable */
#define  DMA_CFGR3_TCIE                              ((uint16_t)0x0002)            /* Transfer complete interrupt enable */
#define  DMA_CFGR3_HTIE                              ((uint16_t)0x0004)            /* Half Transfer interrupt enable */
#define  DMA_CFGR3_TEIE                              ((uint16_t)0x0008)            /* Transfer error interrupt enable */
#define  DMA_CFGR3_DIR                               ((uint16_t)0x0010)            /* Data transfer direction */
#define  DMA_CFGR3_CIRC                              ((uint16_t)0x0020)            /* Circular mode */
#define  DMA_CFGR3_PINC                              ((uint16_t)0x0040)            /* Peripheral increment mode */
#define  DMA_CFGR3_MINC                              ((uint16_t)0x0080)            /* Memory increment mode */

#define  DMA_CFGR3_PSIZE                             ((uint16_t)0x0300)            /* PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CFGR3_PSIZE_0                           ((uint16_t)0x0100)            /* Bit 0 */
#define  DMA_CFGR3_PSIZE_1                           ((uint16_t)0x0200)            /* Bit 1 */

#define  DMA_CFGR3_MSIZE                             ((uint16_t)0x0C00)            /* MSIZE[1:0] bits (Memory size) */
#define  DMA_CFGR3_MSIZE_0                           ((uint16_t)0x0400)            /* Bit 0 */
#define  DMA_CFGR3_MSIZE_1                           ((uint16_t)0x0800)            /* Bit 1 */

#define  DMA_CFGR3_PL                                ((uint16_t)0x3000)            /* PL[1:0] bits (Channel Priority level) */
#define  DMA_CFGR3_PL_0                              ((uint16_t)0x1000)            /* Bit 0 */
#define  DMA_CFGR3_PL_1                              ((uint16_t)0x2000)            /* Bit 1 */

#define  DMA_CFGR3_MEM2MEM                           ((uint16_t)0x4000)            /* Memory to memory mode */
#define  DMA_CFGR3_DOUBLE_MODE                       ((uint16_t)0x8000) 
#define  DMA_CFGR3_FLAG_CUR_MEM                      ((uint32_t)0x00010000) 

/*******************  Bit definition for DMA_CFGR4 register  *******************/
#define  DMA_CFGR4_EN                                ((uint16_t)0x0001)            /* Channel enable */
#define  DMA_CFGR4_TCIE                              ((uint16_t)0x0002)            /* Transfer complete interrupt enable */
#define  DMA_CFGR4_HTIE                              ((uint16_t)0x0004)            /* Half Transfer interrupt enable */
#define  DMA_CFGR4_TEIE                              ((uint16_t)0x0008)            /* Transfer error interrupt enable */
#define  DMA_CFGR4_DIR                               ((uint16_t)0x0010)            /* Data transfer direction */
#define  DMA_CFGR4_CIRC                              ((uint16_t)0x0020)            /* Circular mode */
#define  DMA_CFGR4_PINC                              ((uint16_t)0x0040)            /* Peripheral increment mode */
#define  DMA_CFGR4_MINC                              ((uint16_t)0x0080)            /* Memory increment mode */

#define  DMA_CFGR4_PSIZE                             ((uint16_t)0x0300)            /* PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CFGR4_PSIZE_0                           ((uint16_t)0x0100)            /* Bit 0 */
#define  DMA_CFGR4_PSIZE_1                           ((uint16_t)0x0200)            /* Bit 1 */
             
#define  DMA_CFGR4_MSIZE                             ((uint16_t)0x0C00)            /* MSIZE[1:0] bits (Memory size) */
#define  DMA_CFGR4_MSIZE_0                           ((uint16_t)0x0400)            /* Bit 0 */
#define  DMA_CFGR4_MSIZE_1                           ((uint16_t)0x0800)            /* Bit 1 */
             
#define  DMA_CFGR4_PL                                ((uint16_t)0x3000)            /* PL[1:0] bits (Channel Priority level) */
#define  DMA_CFGR4_PL_0                              ((uint16_t)0x1000)            /* Bit 0 */
#define  DMA_CFGR4_PL_1                              ((uint16_t)0x2000)            /* Bit 1 */
             
#define  DMA_CFGR4_MEM2MEM                           ((uint16_t)0x4000)            /* Memory to memory mode */
#define  DMA_CFGR4_DOUBLE_MODE                       ((uint16_t)0x8000) 
#define  DMA_CFGR4_FLAG_CUR_MEM                      ((uint32_t)0x00010000) 

/******************  Bit definition for DMA_CFGR5 register  *******************/
#define  DMA_CFGR5_EN                                ((uint16_t)0x0001)            /* Channel enable */
#define  DMA_CFGR5_TCIE                              ((uint16_t)0x0002)            /* Transfer complete interrupt enable */
#define  DMA_CFGR5_HTIE                              ((uint16_t)0x0004)            /* Half Transfer interrupt enable */
#define  DMA_CFGR5_TEIE                              ((uint16_t)0x0008)            /* Transfer error interrupt enable */
#define  DMA_CFGR5_DIR                               ((uint16_t)0x0010)            /* Data transfer direction */
#define  DMA_CFGR5_CIRC                              ((uint16_t)0x0020)            /* Circular mode */
#define  DMA_CFGR5_PINC                              ((uint16_t)0x0040)            /* Peripheral increment mode */
#define  DMA_CFGR5_MINC                              ((uint16_t)0x0080)            /* Memory increment mode */
             
#define  DMA_CFGR5_PSIZE                             ((uint16_t)0x0300)            /* PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CFGR5_PSIZE_0                           ((uint16_t)0x0100)            /* Bit 0 */
#define  DMA_CFGR5_PSIZE_1                           ((uint16_t)0x0200)            /* Bit 1 */
             
