openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
#define  AFIO_PCFR1_SWJ_CFG                          ((uint32_t)0x07000000)        /* SWJ_CFG[2:0] bits */
#define  AFIO_PCFR1_SWJ_CFG_0                        ((uint32_t)0x01000000)        /* Bit 0 */
#define  AFIO_PCFR1_SWJ_CFG_1                        ((uint32_t)0x02000000)        /* Bit 1 */
#define  AFIO_PCFR1_SWJ_CFG_2                        ((uint32_t)0x04000000)        /* Bit 2 */

/*****************  Bit definition for AFIO_EXTICR1 register  *****************/
#define  AFIO_EXTICR1_EXTI0                          ((uint16_t)0x000F)            /* EXTI 0 configuration */
#define  AFIO_EXTICR1_EXTI1                          ((uint16_t)0x00F0)            /* EXTI 1 configuration */
#define  AFIO_EXTICR1_EXTI2                          ((uint16_t)0x0F00)            /* EXTI 2 configuration */
#define  AFIO_EXTICR1_EXTI3                          ((uint16_t)0xF000)            /* EXTI 3 configuration */

#define  AFIO_EXTICR1_EXTI0_PA                       ((uint16_t)0x0000)            /* PA[0] pin */
#define  AFIO_EXTICR1_EXTI0_PB                       ((uint16_t)0x0001)            /* PB[0] pin */
#define  AFIO_EXTICR1_EXTI0_PC                       ((uint16_t)0x0002)            /* PC[0] pin */
#define  AFIO_EXTICR1_EXTI0_PD                       ((uint16_t)0x0003)            /* PD[0] pin */

#define  AFIO_EXTICR1_EXTI1_PA                       ((uint16_t)0x0000)            /* PA[1] pin */
#define  AFIO_EXTICR1_EXTI1_PB                       ((uint16_t)0x0010)            /* PB[1] pin */
#define  AFIO_EXTICR1_EXTI1_PC                       ((uint16_t)0x0020)            /* PC[1] pin */
#define  AFIO_EXTICR1_EXTI1_PD                       ((uint16_t)0x0030)            /* PD[1] pin */
 
#define  AFIO_EXTICR1_EXTI2_PA                       ((uint16_t)0x0000)            /* PA[2] pin */
#define  AFIO_EXTICR1_EXTI2_PB                       ((uint16_t)0x0100)            /* PB[2] pin */
#define  AFIO_EXTICR1_EXTI2_PC                       ((uint16_t)0x0200)            /* PC[2] pin */
#define  AFIO_EXTICR1_EXTI2_PD                       ((uint16_t)0x0300)            /* PD[2] pin */

#define  AFIO_EXTICR1_EXTI3_PA                       ((uint16_t)0x0000)            /* PA[3] pin */
#define  AFIO_EXTICR1_EXTI3_PB                       ((uint16_t)0x1000)            /* PB[3] pin */
#define  AFIO_EXTICR1_EXTI3_PC                       ((uint16_t)0x2000)            /* PC[3] pin */
#define  AFIO_EXTICR1_EXTI3_PD                       ((uint16_t)0x3000)            /* PD[3] pin */

/*****************  Bit definition for AFIO_EXTICR2 register  *****************/
#define  AFIO_EXTICR2_EXTI4                          ((uint16_t)0x000F)            /* EXTI 4 configuration */
#define  AFIO_EXTICR2_EXTI5                          ((uint16_t)0x00F0)            /* EXTI 5 configuration */
#define  AFIO_EXTICR2_EXTI6                          ((uint16_t)0x0F00)            /* EXTI 6 configuration */
#define  AFIO_EXTICR2_EXTI7                          ((uint16_t)0xF000)            /* EXTI 7 configuration */

#define  AFIO_EXTICR2_EXTI4_PA                       ((uint16_t)0x0000)            /* PA[4] pin */
#define  AFIO_EXTICR2_EXTI4_PB                       ((uint16_t)0x0001)            /* PB[4] pin */
#define  AFIO_EXTICR2_EXTI4_PC                       ((uint16_t)0x0002)            /* PC[4] pin */
#define  AFIO_EXTICR2_EXTI4_PD                       ((uint16_t)0x0003)            /* PD[4] pin */

#define  AFIO_EXTICR2_EXTI5_PA                       ((uint16_t)0x0000)            /* PA[5] pin */
#define  AFIO_EXTICR2_EXTI5_PB                       ((uint16_t)0x0010)            /* PB[5] pin */
#define  AFIO_EXTICR2_EXTI5_PC                       ((uint16_t)0x0020)            /* PC[5] pin */
#define  AFIO_EXTICR2_EXTI5_PD                       ((uint16_t)0x0030)            /* PD[5] pin */

#define  AFIO_EXTICR2_EXTI6_PA                       ((uint16_t)0x0000)            /* PA[6] pin */
#define  AFIO_EXTICR2_EXTI6_PB                       ((uint16_t)0x0100)            /* PB[6] pin */
#define  AFIO_EXTICR2_EXTI6_PC                       ((uint16_t)0x0200)            /* PC[6] pin */
#define  AFIO_EXTICR2_EXTI6_PD                       ((uint16_t)0x0300)            /* PD[6] pin */

#define  AFIO_EXTICR2_EXTI7_PA                       ((uint16_t)0x0000)            /* PA[7] pin */
#define  AFIO_EXTICR2_EXTI7_PB                       ((uint16_t)0x1000)            /* PB[7] pin */
#define  AFIO_EXTICR2_EXTI7_PC                       ((uint16_t)0x2000)            /* PC[7] pin */
#define  AFIO_EXTICR2_EXTI7_PD                       ((uint16_t)0x3000)            /* PD[7] pin */

/*****************  Bit definition for AFIO_EXTICR3 register  *****************/
#define  AFIO_EXTICR3_EXTI8                          ((uint16_t)0x000F)            /* EXTI 8 configuration */
#define  AFIO_EXTICR3_EXTI9                          ((uint16_t)0x00F0)            /* EXTI 9 configuration */
#define  AFIO_EXTICR3_EXTI10                         ((uint16_t)0x0F00)            /* EXTI 10 configuration */
#define  AFIO_EXTICR3_EXTI11                         ((uint16_t)0xF000)            /* EXTI 11 configuration */

#define  AFIO_EXTICR3_EXTI8_PA                       ((uint16_t)0x0000)            /* PA[8] pin */
#define  AFIO_EXTICR3_EXTI8_PB                       ((uint16_t)0x0001)            /* PB[8] pin */
#define  AFIO_EXTICR3_EXTI8_PC                       ((uint16_t)0x0002)            /* PC[8] pin */
#define  AFIO_EXTICR3_EXTI8_PD                       ((uint16_t)0x0003)            /* PD[8] pin */

#define  AFIO_EXTICR3_EXTI9_PA                       ((uint16_t)0x0000)            /* PA[9] pin */
#define  AFIO_EXTICR3_EXTI9_PB                       ((uint16_t)0x0010)            /* PB[9] pin */
#define  AFIO_EXTICR3_EXTI9_PC                       ((uint16_t)0x0020)            /* PC[9] pin */
#define  AFIO_EXTICR3_EXTI9_PD                       ((uint16_t)0x0030)            /* PD[9] pin */
 
#define  AFIO_EXTICR3_EXTI10_PA                      ((uint16_t)0x0000)            /* PA[10] pin */
#define  AFIO_EXTICR3_EXTI10_PB                      ((uint16_t)0x0100)            /* PB[10] pin */
#define  AFIO_EXTICR3_EXTI10_PC                      ((uint16_t)0x0200)            /* PC[10] pin */
#define  AFIO_EXTICR3_EXTI10_PD                      ((uint16_t)0x0300)            /* PD[10] pin */

