openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
#define  AFIO_EXTICR3_EXTI11_PA                      ((uint16_t)0x0000)            /* PA[11] pin */
#define  AFIO_EXTICR3_EXTI11_PB                      ((uint16_t)0x1000)            /* PB[11] pin */
#define  AFIO_EXTICR3_EXTI11_PC                      ((uint16_t)0x2000)            /* PC[11] pin */
#define  AFIO_EXTICR3_EXTI11_PD                      ((uint16_t)0x3000)            /* PD[11] pin */

/*****************  Bit definition for AFIO_EXTICR4 register  *****************/
#define  AFIO_EXTICR4_EXTI12                         ((uint16_t)0x000F)            /* EXTI 12 configuration */
#define  AFIO_EXTICR4_EXTI13                         ((uint16_t)0x00F0)            /* EXTI 13 configuration */
#define  AFIO_EXTICR4_EXTI14                         ((uint16_t)0x0F00)            /* EXTI 14 configuration */
#define  AFIO_EXTICR4_EXTI15                         ((uint16_t)0xF000)            /* EXTI 15 configuration */

#define  AFIO_EXTICR4_EXTI12_PA                      ((uint16_t)0x0000)            /* PA[12] pin */
#define  AFIO_EXTICR4_EXTI12_PB                      ((uint16_t)0x0001)            /* PB[12] pin */
#define  AFIO_EXTICR4_EXTI12_PC                      ((uint16_t)0x0002)            /* PC[12] pin */
#define  AFIO_EXTICR4_EXTI12_PD                      ((uint16_t)0x0003)            /* PD[12] pin */

#define  AFIO_EXTICR4_EXTI13_PA                      ((uint16_t)0x0000)            /* PA[13] pin */
#define  AFIO_EXTICR4_EXTI13_PB                      ((uint16_t)0x0010)            /* PB[13] pin */
#define  AFIO_EXTICR4_EXTI13_PC                      ((uint16_t)0x0020)            /* PC[13] pin */
#define  AFIO_EXTICR4_EXTI13_PD                      ((uint16_t)0x0030)            /* PD[13] pin */

#define  AFIO_EXTICR4_EXTI14_PA                      ((uint16_t)0x0000)            /* PA[14] pin */
#define  AFIO_EXTICR4_EXTI14_PB                      ((uint16_t)0x0100)            /* PB[14] pin */
#define  AFIO_EXTICR4_EXTI14_PC                      ((uint16_t)0x0200)            /* PC[14] pin */
#define  AFIO_EXTICR4_EXTI14_PD                      ((uint16_t)0x0300)            /* PD[14] pin */

#define  AFIO_EXTICR4_EXTI15_PA                      ((uint16_t)0x0000)            /* PA[15] pin */
#define  AFIO_EXTICR4_EXTI15_PB                      ((uint16_t)0x1000)            /* PB[15] pin */
#define  AFIO_EXTICR4_EXTI15_PC                      ((uint16_t)0x2000)            /* PC[15] pin */
#define  AFIO_EXTICR4_EXTI15_PD                      ((uint16_t)0x3000)            /* PD[15] pin */

/******************  Bit definition for AFIO_CR register  *******************/
#define  AFIO_CR_USBPDHVT                            ((uint32_t)0x00000001)   

#define  AFIO_CR_USBPDRISE                           ((uint32_t)0x00000006)        /* USBPDRISE[1:0] bit*/
#define  AFIO_CR_USBPDRISE_0                         ((uint32_t)0x00000002) 
#define  AFIO_CR_USBPDRISE_1                         ((uint32_t)0x00000004) 

/******************  Bit definition for AFIO_AFLR register  *******************/
#define  AFIO_AFLR_AFR0                              ((uint32_t)0x0000000F)   
#define  AFIO_AFLR_AFR1                              ((uint32_t)0x000000F0)
#define  AFIO_AFLR_AFR2                              ((uint32_t)0x00000F00)
#define  AFIO_AFLR_AFR3                              ((uint32_t)0x0000F000)
#define  AFIO_AFLR_AFR4                              ((uint32_t)0x000F0000)
#define  AFIO_AFLR_AFR5                              ((uint32_t)0x00F00000)
#define  AFIO_AFLR_AFR6                              ((uint32_t)0x0F000000)
#define  AFIO_AFLR_AFR7                              ((uint32_t)0xF0000000)

/******************  Bit definition for AFIO_AFHR register  *******************/
#define  AFIO_AFHR_AFR8                              ((uint32_t)0x0000000F)   
#define  AFIO_AFHR_AFR9                              ((uint32_t)0x000000F0)
#define  AFIO_AFHR_AFR10                             ((uint32_t)0x00000F00)
#define  AFIO_AFHR_AFR11                             ((uint32_t)0x0000F000)
#define  AFIO_AFHR_AFR12                             ((uint32_t)0x000F0000)
#define  AFIO_AFHR_AFR13                             ((uint32_t)0x00F00000)
#define  AFIO_AFHR_AFR14                             ((uint32_t)0x0F000000)
#define  AFIO_AFHR_AFR15                             ((uint32_t)0xF0000000)

/******************************************************************************/
/*                           Independent WATCHDOG                             */
/******************************************************************************/

/*******************  Bit definition for IWDG_CTLR register  ********************/
#define  IWDG_KEY                                    ((uint16_t)0xFFFF)            /* Key value (write only, read 0000h) */

/*******************  Bit definition for IWDG_PSCR register  ********************/
#define  IWDG_PR                                     ((uint8_t)0x07)               /* PR[2:0] (Prescaler divider) */
#define  IWDG_PR_0                                   ((uint8_t)0x01)               /* Bit 0 */
#define  IWDG_PR_1                                   ((uint8_t)0x02)               /* Bit 1 */
#define  IWDG_PR_2                                   ((uint8_t)0x04)               /* Bit 2 */

/*******************  Bit definition for IWDG_RLDR register  *******************/
#define  IWDG_RL                                     ((uint16_t)0x0FFF)            /* Watchdog counter reload value */

/*******************  Bit definition for IWDG_STATR register  ********************/
#define  IWDG_PVU                                    ((uint8_t)0x01)               /* Watchdog prescaler value update */
#define  IWDG_RVU                                    ((uint8_t)0x02)               /* Watchdog counter reload value update */

/******************************************************************************/
/*                      Inter-integrated Circuit Interface                    */
/******************************************************************************/

