openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
/*******************  Bit definition for I2C_CTLR1 register  ********************/
#define  I2C_CTLR1_PE                                ((uint16_t)0x0001)            /* Peripheral Enable */
#define  I2C_CTLR1_ENPEC                             ((uint16_t)0x0020)            /* PEC Enable */
#define  I2C_CTLR1_ENGC                              ((uint16_t)0x0040)            /* General Call Enable */
#define  I2C_CTLR1_NOSTRETCH                         ((uint16_t)0x0080)            /* Clock Stretching Disable (Slave mode) */
#define  I2C_CTLR1_START                             ((uint16_t)0x0100)            /* Start Generation */
#define  I2C_CTLR1_STOP                              ((uint16_t)0x0200)            /* Stop Generation */
#define  I2C_CTLR1_ACK                               ((uint16_t)0x0400)            /* Acknowledge Enable */
#define  I2C_CTLR1_POS                               ((uint16_t)0x0800)            /* Acknowledge/PEC Position (for data reception) */
#define  I2C_CTLR1_PEC                               ((uint16_t)0x1000)            /* Packet Error Checking */
#define  I2C_CTLR1_SWRST                             ((uint16_t)0x8000)            /* Software Reset */

/*******************  Bit definition for I2C_CTLR2 register  ********************/
#define  I2C_CTLR2_FREQ                              ((uint16_t)0x003F)            /* FREQ[5:0] bits (Peripheral Clock Frequency) */
#define  I2C_CTLR2_FREQ_0                            ((uint16_t)0x0001)            /* Bit 0 */
#define  I2C_CTLR2_FREQ_1                            ((uint16_t)0x0002)            /* Bit 1 */
#define  I2C_CTLR2_FREQ_2                            ((uint16_t)0x0004)            /* Bit 2 */
#define  I2C_CTLR2_FREQ_3                            ((uint16_t)0x0008)            /* Bit 3 */
#define  I2C_CTLR2_FREQ_4                            ((uint16_t)0x0010)            /* Bit 4 */
#define  I2C_CTLR2_FREQ_5                            ((uint16_t)0x0020)            /* Bit 5 */

#define  I2C_CTLR2_ITERREN                           ((uint16_t)0x0100)            /* Error Interrupt Enable */
#define  I2C_CTLR2_ITEVTEN                           ((uint16_t)0x0200)            /* Event Interrupt Enable */
#define  I2C_CTLR2_ITBUFEN                           ((uint16_t)0x0400)            /* Buffer Interrupt Enable */
#define  I2C_CTLR2_DMAEN                             ((uint16_t)0x0800)            /* DMA Requests Enable */
#define  I2C_CTLR2_LAST                              ((uint16_t)0x1000)            /* DMA Last Transfer */

/*******************  Bit definition for I2C_OADDR1 register  *******************/
#define  I2C_OADDR1_ADD0                             ((uint16_t)0x0001)
#define  I2C_OADDR1_ADD1_7                           ((uint16_t)0x00FE)            /* Interface Address */
#define  I2C_OADDR1_ADD8_9                           ((uint16_t)0x0300)            /* Interface Address */

#define  I2C_OADDR1_ADD0                             ((uint16_t)0x0001)            /* Bit 0 */
#define  I2C_OADDR1_ADD1                             ((uint16_t)0x0002)            /* Bit 1 */
#define  I2C_OADDR1_ADD2                             ((uint16_t)0x0004)            /* Bit 2 */
#define  I2C_OADDR1_ADD3                             ((uint16_t)0x0008)            /* Bit 3 */
#define  I2C_OADDR1_ADD4                             ((uint16_t)0x0010)            /* Bit 4 */
#define  I2C_OADDR1_ADD5                             ((uint16_t)0x0020)            /* Bit 5 */
#define  I2C_OADDR1_ADD6                             ((uint16_t)0x0040)            /* Bit 6 */
#define  I2C_OADDR1_ADD7                             ((uint16_t)0x0080)            /* Bit 7 */
#define  I2C_OADDR1_ADD8                             ((uint16_t)0x0100)            /* Bit 8 */
#define  I2C_OADDR1_ADD9                             ((uint16_t)0x0200)            /* Bit 9 */

#define  I2C_OADDR1_ADDMODE                          ((uint16_t)0x8000)            /* Addressing Mode (Slave mode) */

/*******************  Bit definition for I2C_OADDR2 register  *******************/
#define  I2C_OADDR2_ENDUAL                           ((uint8_t)0x01)               /* Dual addressing mode enable */
#define  I2C_OADDR2_ADD2                             ((uint8_t)0xFE)               /* Interface address */

/********************  Bit definition for I2C_DATAR register  ********************/
#define  I2C_DR_DATAR                                ((uint8_t)0xFF)               /* 8-bit Data Register */

/*******************  Bit definition for I2C_STAR1 register  ********************/
#define  I2C_STAR1_SB                                ((uint16_t)0x0001)            /* Start Bit (Master mode) */
#define  I2C_STAR1_ADDR                              ((uint16_t)0x0002)            /* Address sent (master mode)/matched (slave mode) */
#define  I2C_STAR1_BTF                               ((uint16_t)0x0004)            /* Byte Transfer Finished */
#define  I2C_STAR1_ADD10                             ((uint16_t)0x0008)            /* 10-bit header sent (Master mode) */
#define  I2C_STAR1_STOPF                             ((uint16_t)0x0010)            /* Stop detection (Slave mode) */
#define  I2C_STAR1_RXNE                              ((uint16_t)0x0040)            /* Data Register not Empty (receivers) */
#define  I2C_STAR1_TXE                               ((uint16_t)0x0080)            /* Data Register Empty (transmitters) */
#define  I2C_STAR1_BERR                              ((uint16_t)0x0100)            /* Bus Error */
#define  I2C_STAR1_ARLO                              ((uint16_t)0x0200)            /* Arbitration Lost (master mode) */
#define  I2C_STAR1_AF                                ((uint16_t)0x0400)            /* Acknowledge Failure */
#define  I2C_STAR1_OVR                               ((uint16_t)0x0800)            /* Overrun/Underrun */
#define  I2C_STAR1_PECERR                            ((uint16_t)0x1000)            /* PEC Error in reception */

/*******************  Bit definition for I2C_STAR2 register  ********************/
#define  I2C_STAR2_MSL                               ((uint16_t)0x0001)            /* Master/Slave */
#define  I2C_STAR2_BUSY                              ((uint16_t)0x0002)            /* Bus Busy */
#define  I2C_STAR2_TRA                               ((uint16_t)0x0004)            /* Transmitter/Receiver */
#define  I2C_STAR2_GENCALL                           ((uint16_t)0x0010)            /* General Call Address (Slave mode) */
#define  I2C_STAR2_DUALF                             ((uint16_t)0x0080)            /* Dual Flag (Slave mode) */
#define  I2C_STAR2_PEC                               ((uint16_t)0xFF00)            /* Packet Error Checking Register */

/*******************  Bit definition for I2C_CKCFGR register  ********************/
#define  I2C_CKCFGR_CCR                              ((uint16_t)0x0FFF)            /* Clock Control Register in Fast/Standard mode (Master mode) */
#define  I2C_CKCFGR_DUTY                             ((uint16_t)0x4000)            /* Fast Mode Duty Cycle */
#define  I2C_CKCFGR_FS                               ((uint16_t)0x8000)            /* I2C Master Mode Selection */

/******************************************************************************/
/*                             Power Control                                  */
/******************************************************************************/

/********************  Bit definition for PWR_CTLR register  ********************/
#define  PWR_CTLR_LPDS                               ((uint16_t)0x0001)     /* Low-Power Deepsleep */
#define  PWR_CTLR_PVDE                               ((uint16_t)0x0010)     /* Power Voltage Detector Enable */

#define  PWR_CTLR_PLS                                ((uint16_t)0x0060)     /* PLS[1:0] bits (PVD Level Selection) */
#define  PWR_CTLR_PLS_0                              ((uint16_t)0x0020)     /* Bit 0 */
#define  PWR_CTLR_PLS_1                              ((uint16_t)0x0040)     /* Bit 1 */

