openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
#define  PWR_CTLR_PLS_MODE0                          ((uint16_t)0x0000)     
#define  PWR_CTLR_PLS_MODE1                          ((uint16_t)0x0020)     
#define  PWR_CTLR_PLS_MODE2                          ((uint16_t)0x0040)     
#define  PWR_CTLR_PLS_MODE3                          ((uint16_t)0x0060)     

#define  PWR_CTLR_PLAN                               ((uint16_t)0x0080)     

#define  PWR_CTLR_LDO_VDDK                           ((uint16_t)0x0700)   
#define  PWR_CTLR_LDO_VDD12A                         ((uint16_t)0x3800)

/*******************  Bit definition for PWR_CSR register  ********************/
#define  PWR_CSR_PVDO                                ((uint16_t)0x0001)     /* PVD Output */

/******************************************************************************/
/*                         Reset and Clock Control                            */
/******************************************************************************/

/********************  Bit definition for RCC_CTLR register  ********************/
#define  RCC_HSION                                   ((uint32_t)0x00000001)        /* Internal High Speed clock enable */
#define  RCC_HSIRDY                                  ((uint32_t)0x00000002)        /* Internal High Speed clock ready flag */
#define  RCC_LPMSRC                                  ((uint32_t)0x00000100)  
#define  RCC_LPMGATE                                 ((uint32_t)0x00000200)
#define  RCC_HSEON                                   ((uint32_t)0x00010000)        /* External High Speed clock enable */
#define  RCC_HSERDY                                  ((uint32_t)0x00020000)        /* External High Speed clock ready flag */
#define  RCC_HSEBYP                                  ((uint32_t)0x00040000)        /* External High Speed clock Bypass */
#define  RCC_CSSON                                   ((uint32_t)0x00080000)        /* Clock Security System enable */

#define  RCC_USBHSPLLON                              ((uint32_t)0x01000000)        /* PLL enable */
#define  RCC_USBHSPLLRDY                             ((uint32_t)0x02000000)        /* PLL clock ready flag */
#define  RCC_USBSSPLLON                              ((uint32_t)0x04000000)
#define  RCC_USBSSPLLRDY                             ((uint32_t)0x08000000)

#define  RCC_PIPEON                                  ((uint32_t)0x10000000)
#define  RCC_PIXISTAT                                ((uint32_t)0x20000000)
#define  RCC_PLLGATE                                 ((uint32_t)0x80000000)

/*******************  Bit definition for RCC_CFGR0 register  *******************/
#define  RCC_SW                                      ((uint32_t)0x00000003)        /* SW[1:0] bits (System clock Switch) */
#define  RCC_SW_0                                    ((uint32_t)0x00000001)        /* Bit 0 */
#define  RCC_SW_1                                    ((uint32_t)0x00000002)        /* Bit 1 */

#define  RCC_SW_HSI                                  ((uint32_t)0x00000000)        /* HSI selected as system clock */
#define  RCC_SW_HSE                                  ((uint32_t)0x00000001)        /* HSE selected as system clock */
#define  RCC_SW_PLL                                  ((uint32_t)0x00000002)        /* PLL selected as system clock */

#define  RCC_SWS                                     ((uint32_t)0x0000000C)        /* SWS[1:0] bits (System Clock Switch Status) */
#define  RCC_SWS_0                                   ((uint32_t)0x00000004)        /* Bit 0 */
#define  RCC_SWS_1                                   ((uint32_t)0x00000008)        /* Bit 1 */

#define  RCC_SWS_HSI                                 ((uint32_t)0x00000000)        /* HSI oscillator used as system clock */
#define  RCC_SWS_HSE                                 ((uint32_t)0x00000004)        /* HSE oscillator used as system clock */
#define  RCC_SWS_PLL                                 ((uint32_t)0x00000008)        /* PLL used as system clock */

#define  RCC_HPRE                                    ((uint32_t)0x000000F0)        /* HPRE[3:0] bits (HB prescaler) */
#define  RCC_HPRE_0                                  ((uint32_t)0x00000010)        /* Bit 0 */
#define  RCC_HPRE_1                                  ((uint32_t)0x00000020)        /* Bit 1 */
#define  RCC_HPRE_2                                  ((uint32_t)0x00000040)        /* Bit 2 */
#define  RCC_HPRE_3                                  ((uint32_t)0x00000080)        /* Bit 3 */

#define  RCC_HPRE_DIV1                               ((uint32_t)0x00000000)        /* SYSCLK not divided */
#define  RCC_HPRE_DIV2                               ((uint32_t)0x00000080)        /* SYSCLK divided by 2 */
#define  RCC_HPRE_DIV4                               ((uint32_t)0x00000090)        /* SYSCLK divided by 4 */
#define  RCC_HPRE_DIV8                               ((uint32_t)0x000000A0)        /* SYSCLK divided by 8 */
#define  RCC_HPRE_DIV16                              ((uint32_t)0x000000B0)        /* SYSCLK divided by 16 */
#define  RCC_HPRE_DIV64                              ((uint32_t)0x000000C0)        /* SYSCLK divided by 64 */
#define  RCC_HPRE_DIV128                             ((uint32_t)0x000000D0)        /* SYSCLK divided by 128 */
#define  RCC_HPRE_DIV256                             ((uint32_t)0x000000E0)        /* SYSCLK divided by 256 */
#define  RCC_HPRE_DIV512                             ((uint32_t)0x000000F0)        /* SYSCLK divided by 512 */

#define  RCC_FPRE                                    ((uint32_t)0x00000100)        /* FPRE bits (HCLK source prescaler) */

#define  RCC_FPRE_DIV1                               ((uint32_t)0x00000000)
#define  RCC_FPRE_DIV2                               ((uint32_t)0x00000100)

#define  RCC_PPRE2                                   ((uint32_t)0x00003800)        /* PRE2[2:0] bits (PB2 prescaler) */
#define  RCC_PPRE2_0                                 ((uint32_t)0x00000800)        /* Bit 0 */
#define  RCC_PPRE2_1                                 ((uint32_t)0x00001000)        /* Bit 1 */
#define  RCC_PPRE2_2                                 ((uint32_t)0x00002000)        /* Bit 2 */

#define  RCC_PPRE2_DIV1                              ((uint32_t)0x00000000)        /* HCLK not divided */
#define  RCC_PPRE2_DIV2                              ((uint32_t)0x00002000)        /* HCLK divided by 2 */
#define  RCC_PPRE2_DIV4                              ((uint32_t)0x00002800)        /* HCLK divided by 4 */
#define  RCC_PPRE2_DIV8                              ((uint32_t)0x00003000)        /* HCLK divided by 8 */
#define  RCC_PPRE2_DIV16                             ((uint32_t)0x00003800)        /* HCLK divided by 16 */

#define  RCC_ADCPRE                                  ((uint32_t)0x0000C000)        /* ADCPRE[1:0] bits (ADC prescaler) */
#define  RCC_ADCPRE_0                                ((uint32_t)0x00004000)        /* Bit 0 */
#define  RCC_ADCPRE_1                                ((uint32_t)0x00008000)        /* Bit 1 */

#define  RCC_ADCPRE_DIV2                             ((uint32_t)0x00000000)        /* PCLK2 divided by 2 */
#define  RCC_ADCPRE_DIV4                             ((uint32_t)0x00004000)        /* PCLK2 divided by 4 */
#define  RCC_ADCPRE_DIV6                             ((uint32_t)0x00008000)        /* PCLK2 divided by 6 */
#define  RCC_ADCPRE_DIV8                             ((uint32_t)0x0000C000)        /* PCLK2 divided by 8 */

#define  RCC_PLLDIV                                  ((uint32_t)0x001E0000)        /* PLLDIV[3:0] bits (PLL multiplication factor) */
#define  RCC_PLLDIV_0                                ((uint32_t)0x00020000)        /* Bit 0 */
#define  RCC_PLLDIV_1                                ((uint32_t)0x00040000)        /* Bit 1 */
#define  RCC_PLLDIV_2                                ((uint32_t)0x00080000)        /* Bit 2 */
#define  RCC_PLLDIV_3                                ((uint32_t)0x00100000)        /* Bit 3 */
 
