openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
#define  RCC_PLLDIV2                                 ((uint32_t)0x00020000)
#define  RCC_PLLDIV3                                 ((uint32_t)0x00040000)
#define  RCC_PLLDIV4                                 ((uint32_t)0x00060000)
#define  RCC_PLLDIV5                                 ((uint32_t)0x00080000)
#define  RCC_PLLDIV6                                 ((uint32_t)0x000A0000)
#define  RCC_PLLDIV7                                 ((uint32_t)0x000C0000)
#define  RCC_PLLDIV8                                 ((uint32_t)0x000E0000)
#define  RCC_PLLDIV9                                 ((uint32_t)0x00100000)
#define  RCC_PLLDIV10                                ((uint32_t)0x00120000)
#define  RCC_PLLDIV11                                ((uint32_t)0x00140000)
#define  RCC_PLLDIV12                                ((uint32_t)0x00160000)
#define  RCC_PLLDIV13                                ((uint32_t)0x00180000)
#define  RCC_PLLDIV14                                ((uint32_t)0x001A0000)
#define  RCC_PLLDIV15                                ((uint32_t)0x001C0000)
#define  RCC_PLLDIV16                                ((uint32_t)0x001E0000)

#define  RCC_PLLSRC                                  ((uint32_t)0x00600000) 
#define  RCC_PLLSRC_1                                ((uint32_t)0x00200000) 
#define  RCC_PLLSRC_2                                ((uint32_t)0x00400000) 

#define  RCC_PLLSRC_USBHSPLL_480M                    ((uint32_t)0x00000000)        /* USBHSPLL 480M clock selected as PLL entry clock source */
#define  RCC_PLLSRC_HS                               ((uint32_t)0x00600000)        /* PLL entry clock source is determined by PLLHS_SRC */
#define  RCC_PLLSRC_HS_1                             ((uint32_t)0x00200000)
#define  RCC_PLLSRC_USBSSPLL_625M                    ((uint32_t)0x00400000)        /* USBSSPLL 625M clock selected as PLL entry clock source */

#define  RCC_UTMION                                  ((uint32_t)0x00800000) 

#define  RCC_CFGR0_MCO                               ((uint32_t)0x0F000000)        /* MCO[3:0] bits (Microcontroller Clock Output) */
#define  RCC_MCO_0                                   ((uint32_t)0x01000000)        /* Bit 0 */
#define  RCC_MCO_1                                   ((uint32_t)0x02000000)        /* Bit 1 */
#define  RCC_MCO_2                                   ((uint32_t)0x04000000)        /* Bit 2 */
#define  RCC_MCO_3                                   ((uint32_t)0x08000000)        /* Bit 3 */

#define  RCC_MCO_NOCLOCK                             ((uint32_t)0x00000000)        /* No clock */
#define  RCC_CFGR0_MCO_SYSCLK                        ((uint32_t)0x04000000)        /* System clock selected as MCO source */
#define  RCC_CFGR0_MCO_HSI                           ((uint32_t)0x05000000)        /* HSI clock selected as MCO source */
#define  RCC_CFGR0_MCO_HSE                           ((uint32_t)0x06000000)        /* HSE clock selected as MCO source  */
#define  RCC_CFGR0_MCO_PLLD8                         ((uint32_t)0x07000000)        /* PLL clock divided by 8 selected as MCO source */

#define  RCC_PLLHS_SRC                               ((uint32_t)0x30000000)
#define  RCC_PLLHS_SRC_0                             ((uint32_t)0x10000000)
#define  RCC_PLLHS_SRC_1                             ((uint32_t)0x20000000)

#define  RCC_PLLHS_SRC_USBSSPLL_125M                 ((uint32_t)0x00000000)
#define  RCC_PLLHS_SRC_USBSSPLL_357M                 ((uint32_t)0x10000000)
#define  RCC_PLLHS_SRC_USBSSPLL_625M                 ((uint32_t)0x20000000)        /* Only applicable to chips with a batch number greater than zero in the fifth digit */
#define  RCC_PLLHS_SRC_USBHSPLL_480M                 ((uint32_t)0x30000000)

/*******************  Bit definition for RCC_INTR register  ********************/
#define  RCC_LSIRDYF                                 ((uint32_t)0x00000001)        /* LSI Ready Interrupt flag */
#define  RCC_LSERDYF                                 ((uint32_t)0x00000002)        /* LSE Ready Interrupt flag */
#define  RCC_HSIRDYF                                 ((uint32_t)0x00000004)        /* HSI Ready Interrupt flag */
#define  RCC_HSERDYF                                 ((uint32_t)0x00000008)        /* HSE Ready Interrupt flag */
#define  RCC_CSSF                                    ((uint32_t)0x00000080)        /* Clock Security System Interrupt flag */
#define  RCC_LSIRDYIE                                ((uint32_t)0x00000100)        /* LSI Ready Interrupt Enable */
#define  RCC_LSERDYIE                                ((uint32_t)0x00000200)        /* LSE Ready Interrupt Enable */
#define  RCC_HSIRDYIE                                ((uint32_t)0x00000400)        /* HSI Ready Interrupt Enable */
#define  RCC_HSERDYIE                                ((uint32_t)0x00000800)        /* HSE Ready Interrupt Enable */

/*****************  Bit definition for RCC_HB2PRSTR register  *****************/
#define  RCC_AFIORST                                 ((uint32_t)0x00000001)        /* Alternate Function I/O reset */
#define  RCC_IOPARST                                 ((uint32_t)0x00000004)        /* I/O port A reset */
#define  RCC_IOPBRST                                 ((uint32_t)0x00000008)        /* I/O port B reset */
#define  RCC_IOPCRST                                 ((uint32_t)0x00000010)        /* I/O port C reset */
#define  RCC_IOPDRST                                 ((uint32_t)0x00000020)        /* I/O port D reset */
#define  RCC_ADC1RST                                 ((uint32_t)0x00000200)        /* ADC 1 interface reset */
#define  RCC_ADC2RST                                 ((uint32_t)0x00000400)        /* ADC 2 interface reset */
#define  RCC_TIM1RST                                 ((uint32_t)0x00000800)        /* TIM1 Timer reset */
#define  RCC_SPI1RST                                 ((uint32_t)0x00001000)        /* SPI 1 reset */
#define  RCC_USART1RST                               ((uint32_t)0x00004000)        /* USART1 reset */
#define  RCC_ADC3RST                                 ((uint32_t)0x00008000)        /* ADC 3 interface reset */
#define  RCC_ADC4RST                                 ((uint32_t)0x00010000)        /* ADC 4 interface reset */

/*****************  Bit definition for RCC_HB1PRSTR register  *****************/
#define  RCC_TIM2RST                                 ((uint32_t)0x00000001)        /* Timer 2 reset */
#define  RCC_TIM3RST                                 ((uint32_t)0x00000002)        /* Timer 3 reset */
#define  RCC_TIM4RST                                 ((uint32_t)0x00000004)        /* Timer 4 reset */
#define  RCC_WWDGRST                                 ((uint32_t)0x00000800)        /* Window Watchdog reset */
#define  RCC_SPI2RST                                 ((uint32_t)0x00004000)        /* SPI 2 reset */
#define  RCC_SPI3RST                                 ((uint32_t)0x00008000)        /* SPI 3 reset */
#define  RCC_USART2RST                               ((uint32_t)0x00020000)        /* USART 2 reset */
#define  RCC_USART3RST                               ((uint32_t)0x00040000)        /* USART 3 reset */
#define  RCC_USART4RST                               ((uint32_t)0x00080000)        /* USART 4 reset */
#define  RCC_I2C1RST                                 ((uint32_t)0x00200000)        /* I2C 1 reset */
#define  RCC_I2C2RST                                 ((uint32_t)0x00400000)        /* I2C 2 reset */ 
#define  RCC_PWRRST                                  ((uint32_t)0x10000000)        /* Power interface reset */

/******************  Bit definition for RCC_HBPCENR register  ******************/
#define  RCC_DMA1EN                                  ((uint16_t)0x0001)            /* DMA1 clock enable */
#define  RCC_CRCEN                                   ((uint16_t)0x0040)            /* CRC clock enable */
#define  RCC_USBHSEN                                 ((uint16_t)0x0800)
#define  RCC_USBPDEN                                 ((uint16_t)0x1000)
#define  RCC_ARGBEN                                  ((uint16_t)0x4000)
#define  RCC_USBSSEN                                 ((uint16_t)0x8000)

/******************  Bit definition for RCC_HB2PCENR register  *****************/
#define  RCC_AFIOEN                                  ((uint32_t)0x00000001)         /* Alternate Function I/O clock enable */
#define  RCC_IOPAEN                                  ((uint32_t)0x00000004)         /* I/O port A clock enable */
#define  RCC_IOPBEN                                  ((uint32_t)0x00000008)         /* I/O port B clock enable */
#define  RCC_IOPCEN                                  ((uint32_t)0x00000010)         /* I/O port C clock enable */
#define  RCC_IOPDEN                                  ((uint32_t)0x00000020)         /* I/O port D clock enable */

#define  RCC_ADC1EN                                  ((uint32_t)0x00000200)         /* ADC 1 interface clock enable */
#define  RCC_ADC2EN                                  ((uint32_t)0x00000400)         /* ADC 2 interface clock enable */
#define  RCC_TIM1EN                                  ((uint32_t)0x00000800)         /* TIM1 Timer clock enable */
#define  RCC_SPI1EN                                  ((uint32_t)0x00001000)         /* SPI 1 clock enable */
#define  RCC_USART1EN                                ((uint32_t)0x00004000)         /* USART1 clock enable */
#define  RCC_ADC3EN                                  ((uint32_t)0x00008000)         /* ADC 3 interface clock enable */
#define  RCC_ADC4EN                                  ((uint32_t)0x00010000)         /* ADC 4 interface clock enable */

/*****************  Bit definition for RCC_HB1PCENR register  ******************/
#define  RCC_TIM2EN                                  ((uint32_t)0x00000001)        /* Timer 2 clock enabled*/
#define  RCC_TIM3EN                                  ((uint32_t)0x00000002)        /* Timer 3 clock enable */
#define  RCC_TIM4EN                                  ((uint32_t)0x00000004)
#define  RCC_WWDGEN                                  ((uint32_t)0x00000800)        /* Window Watchdog clock enable */
#define  RCC_SPI2EN                                  ((uint32_t)0x00004000)
#define  RCC_SPI3EN                                  ((uint32_t)0x00008000)
#define  RCC_USART2EN                                ((uint32_t)0x00020000)        /* USART 2 clock enable */
#define  RCC_USART3EN                                ((uint32_t)0x00040000)
#define  RCC_USART4EN                                ((uint32_t)0x00080000)
#define  RCC_I2C1EN                                  ((uint32_t)0x00200000)        /* I2C 1 clock enable */
#define  RCC_I2C2EN                                  ((uint32_t)0x00400000)
#define  RCC_PWREN                                   ((uint32_t)0x10000000)        /* Power interface clock enable */

/*******************  Bit definition for RCC_RSTSCKR register  ********************/  
#define  RCC_LSION                                   ((uint32_t)0x00000001)        /* Internal Low Speed oscillator enable */
#define  RCC_LSIRDY                                  ((uint32_t)0x00000002)        /* Internal Low Speed oscillator Ready */

#define  RCC_LKUPRSTF                                ((uint32_t)0x00040000)        /* LOCKUP reset flag */
#define  RCC_ADC3AWDRSTF                             ((uint32_t)0x00080000)        /* ADC3 AWD reset flag */
#define  RCC_ADC4AWDRSTF                             ((uint32_t)0x00100000)        /* ADC4 AWD reset flag */
#define  RCC_USBPDRSTF                               ((uint32_t)0x00200000)        /* USBPD reset flag */
#define  RCC_ADC1AWDRSTF                             ((uint32_t)0x00400000)        /* ADC1 AWD reset flag */
#define  RCC_ADC2AWDRSTF                             ((uint32_t)0x00800000)        /* ADC2 AWD reset flag */
#define  RCC_RMVF                                    ((uint32_t)0x01000000)        /* Remove reset flag */
#define  RCC_PINRSTF                                 ((uint32_t)0x04000000)        /* PIN reset flag */
#define  RCC_PORRSTF                                 ((uint32_t)0x08000000)        /* POR/PDR reset flag */
#define  RCC_SFTRSTF                                 ((uint32_t)0x10000000)        /* Software Reset flag */
#define  RCC_IWDGRSTF                                ((uint32_t)0x20000000)        /* Independent Watchdog reset flag */
#define  RCC_WWDGRSTF                                ((uint32_t)0x40000000)        /* Window watchdog reset flag */

/*******************  Bit definition for RCC_HBRSTR register  ********************/  
#define  RCC_USBHSRST                                ((uint32_t)0x00000800)    
#define  RCC_USBPDRST                                ((uint32_t)0x00001000)        
#define  RCC_ARGBRST                                 ((uint32_t)0x00004000)        
#define  RCC_USBSSRST                                ((uint32_t)0x00008000)      

/*******************  Bit definition for RCC_CFGR2 register  ********************/  
#define  RCC_USBHSPLLREFSEL                          ((uint32_t)0x00000007)   
#define  RCC_USBHSPLLREFSEL_0                        ((uint32_t)0x00000001) 
#define  RCC_USBHSPLLREFSEL_1                        ((uint32_t)0x00000002) 
#define  RCC_USBHSPLLREFSEL_2                        ((uint32_t)0x00000004) 

#define  RCC_USBHSPLLREFSEL_12MHz                    ((uint32_t)0x00000000) 
#define  RCC_USBHSPLLREFSEL_20MHz                    ((uint32_t)0x00000001)
#define  RCC_USBHSPLLREFSEL_24MHz                    ((uint32_t)0x00000002)
#define  RCC_USBHSPLLREFSEL_25MHz                    ((uint32_t)0x00000003)
#define  RCC_USBHSPLLREFSEL_32MHz                    ((uint32_t)0x00000004)

#define  RCC_USBSSPLLREFSEL                          ((uint32_t)0x00000038)
#define  RCC_USBSSPLLREFSEL_0                        ((uint32_t)0x00000008)
#define  RCC_USBSSPLLREFSEL_1                        ((uint32_t)0x00000010)
#define  RCC_USBSSPLLREFSEL_2                        ((uint32_t)0x00000020)

#define  RCC_USBSSPLLREFSEL_20MHz                    ((uint32_t)0x00000000)
#define  RCC_USBSSPLLREFSEL_24MHz                    ((uint32_t)0x00000008)
#define  RCC_USBSSPLLREFSEL_25MHz                    ((uint32_t)0x00000010)
#define  RCC_USBSSPLLREFSEL_30MHz                    ((uint32_t)0x00000018)
#define  RCC_USBSSPLLREFSEL_32MHz                    ((uint32_t)0x00000020)
#define  RCC_USBSSPLLREFSEL_40MHz                    ((uint32_t)0x00000028)
#define  RCC_USBSSPLLREFSEL_60MHz                    ((uint32_t)0x00000030)
#define  RCC_USBSSPLLREFSEL_80MHz                    ((uint32_t)0x00000038)

#define  RCC_USBPLLSRCCFG                            ((uint32_t)0x000000C0)
#define  RCC_USBPLLSRCCFG_0                          ((uint32_t)0x00000040)
#define  RCC_USBPLLSRCCFG_1                          ((uint32_t)0x00000080)

