openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
#define  RCC_USBHSPLLSRC_USBHSPLLSRC                 ((uint32_t)0x00000000)
#define  RCC_USBHSPLLSRC_USBSSPLL_625M_DIV25         ((uint32_t)0x00000040)
#define  RCC_USBSSPLLSRC_USBHSPLL_480M_DIV24         ((uint32_t)0x00000080)
#define  RCC_USBSSPLLSRC_USBSSPLLSRC                 ((uint32_t)0x000000C0)

#define  RCC_USBHSPLLSRCC                            ((uint32_t)0x00000100)
#define  RCC_USBHSPLLSRCC_HSE                        ((uint32_t)0x00000000)
#define  RCC_USBHSPLLSRCC_HSI                        ((uint32_t)0x00000100)

#define  RCC_USBSSPLLSRCC                            ((uint32_t)0x00000200)
#define  RCC_USBSSPLLSRCC_HSE                        ((uint32_t)0x00000000)
#define  RCC_USBSSPLLSRCC_HSI                        ((uint32_t)0x00000200)

#define  RCC_HSERDYCFG                               ((uint32_t)0x00030000)
#define  RCC_HSERDYCFG_0                             ((uint32_t)0x00010000)
#define  RCC_HSERDYCFG_1                             ((uint32_t)0x00020000)

#define  RCC_HSERDYCFG0                              ((uint32_t)0x00000000)
#define  RCC_HSERDYCFG1                              ((uint32_t)0x00010000)
#define  RCC_HSERDYCFG2                              ((uint32_t)0x00020000)
#define  RCC_HSERDYCFG3                              ((uint32_t)0x00030000)

#define  RCC_USBHSPLLRDYCFG                          ((uint32_t)0x000C0000)
#define  RCC_USBHSPLLRDYCFG_0                        ((uint32_t)0x00040000)
#define  RCC_USBHSPLLRDYCFG_1                        ((uint32_t)0x00080000)

#define  RCC_USBHSPLLRDYCFG0                         ((uint32_t)0x00000000)
#define  RCC_USBHSPLLRDYCFG1                         ((uint32_t)0x00040000)
#define  RCC_USBHSPLLRDYCFG2                         ((uint32_t)0x00080000)
#define  RCC_USBHSPLLRDYCFG3                         ((uint32_t)0x000C0000)

#define  RCC_USBSSPLLRDYCFG                          ((uint32_t)0x00300000)
#define  RCC_USBSSPLLRDYCFG_0                        ((uint32_t)0x00100000)
#define  RCC_USBSSPLLRDYCFG_1                        ((uint32_t)0x00200000)

#define  RCC_USBSSPLLRDYCFG0                         ((uint32_t)0x00000000)
#define  RCC_USBSSPLLRDYCFG1                         ((uint32_t)0x00100000)
#define  RCC_USBSSPLLRDYCFG2                         ((uint32_t)0x00200000)
#define  RCC_USBSSPLLRDYCFG3                         ((uint32_t)0x00300000)

#define  RCC_ADCSRC                                  ((uint32_t)0x01000000)

#define  RCC_ADCSRC_HCLK                             ((uint32_t)0x00000000)
#define  RCC_ADCSRC_USBPLL                           ((uint32_t)0x01000000)

#define  RCC_ADCDUTYMD                               ((uint32_t)0x06000000)
#define  RCC_ADCDUTYMD_0                             ((uint32_t)0x02000000)
#define  RCC_ADCDUTYMD_1                             ((uint32_t)0x04000000)

#define  RCC_ADCDUTYMD0                              ((uint32_t)0x00000000)
#define  RCC_ADCDUTYMD1                              ((uint32_t)0x02000000)
#define  RCC_ADCDUTYMD2                              ((uint32_t)0x04000000)
#define  RCC_ADCDUTYMD3                              ((uint32_t)0x06000000)

#define  RCC_ADCPLLSRC                               ((uint32_t)0x08000000)

#define  RCC_ADCPLLSRC_USBHSPLL_480MHz               ((uint32_t)0x00000000)
#define  RCC_ADCPLLSRC_USBSSPLL_625MHz               ((uint32_t)0x08000000)

#define  RCC_ADCCLKDIV                               ((uint32_t)0xF0000000)
#define  RCC_ADCCLKDIV_0                             ((uint32_t)0x10000000)
#define  RCC_ADCCLKDIV_1                             ((uint32_t)0x20000000)
#define  RCC_ADCCLKDIV_2                             ((uint32_t)0x40000000)
#define  RCC_ADCCLKDIV_3                             ((uint32_t)0x80000000)

#define  RCC_ADCCLKDIV1                              ((uint32_t)0x00000000)
#define  RCC_ADCCLKDIV2                              ((uint32_t)0x10000000)
#define  RCC_ADCCLKDIV3                              ((uint32_t)0x20000000)
#define  RCC_ADCCLKDIV4                              ((uint32_t)0x30000000)
#define  RCC_ADCCLKDIV5                              ((uint32_t)0x40000000)
#define  RCC_ADCCLKDIV6                              ((uint32_t)0x50000000)
#define  RCC_ADCCLKDIV7                              ((uint32_t)0x60000000)
#define  RCC_ADCCLKDIV8                              ((uint32_t)0x70000000)
#define  RCC_ADCCLKDIV9                              ((uint32_t)0x80000000)
#define  RCC_ADCCLKDIV10                             ((uint32_t)0x90000000)
#define  RCC_ADCCLKDIV11                             ((uint32_t)0xA0000000)
#define  RCC_ADCCLKDIV12                             ((uint32_t)0xB0000000)
#define  RCC_ADCCLKDIV13                             ((uint32_t)0xC0000000)
#define  RCC_ADCCLKDIV14                             ((uint32_t)0xD0000000)
#define  RCC_ADCCLKDIV15                             ((uint32_t)0xE0000000)
#define  RCC_ADCCLKDIV16                             ((uint32_t)0xF0000000)

/******************************************************************************/
/*                             Real-Time Clock                                */
/******************************************************************************/

/*******************  Bit definition for RTC_CTLRH register  ********************/
#define  RTC_CTLRH_SECIE                             ((uint8_t)0x01)               /* Second Interrupt Enable */
#define  RTC_CTLRH_ALRIE                             ((uint8_t)0x02)               /* Alarm Interrupt Enable */
#define  RTC_CTLRH_OWIE                              ((uint8_t)0x04)               /* OverfloW Interrupt Enable */

/*******************  Bit definition for RTC_CTLRL register  ********************/
#define  RTC_CTLRL_SECF                              ((uint8_t)0x01)               /* Second Flag */
#define  RTC_CTLRL_ALRF                              ((uint8_t)0x02)               /* Alarm Flag */
#define  RTC_CTLRL_OWF                               ((uint8_t)0x04)               /* OverfloW Flag */
#define  RTC_CTLRL_RSF                               ((uint8_t)0x08)               /* Registers Synchronized Flag */
#define  RTC_CTLRL_CNF                               ((uint8_t)0x10)               /* Configuration Flag */
#define  RTC_CTLRL_RTOFF                             ((uint8_t)0x20)               /* RTC operation OFF */
#define  RTC_CTLRL_RTCEN                             ((uint8_t)0x40) 
#define  RTC_CTLRL_RTCSEL                            ((uint8_t)0x80) 
#define  RTC_CTLRL_CCO                               ((uint16_t)0x100) 
#define  RTC_CTLRL_ASOE                              ((uint16_t)0x200) 
#define  RTC_CTLRL_ASOS                              ((uint16_t)0x400) 

#define  RTC_CTLRL_RTCCAL                            ((uint32_t)0x0003F800) 

