openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
/*******************  Bit definition for RTC_PSCH register  *******************/
#define  RTC_PSCH_PRL                                ((uint16_t)0x000F)            /* RTC Prescaler Reload Value High */

/*******************  Bit definition for RTC_PRLL register  *******************/
#define  RTC_PSCL_PRL                                ((uint16_t)0xFFFF)            /* RTC Prescaler Reload Value Low */

/*******************  Bit definition for RTC_DIVH register  *******************/
#define  RTC_DIVH_RTC_DIV                            ((uint16_t)0x000F)            /* RTC Clock Divider High */

/*******************  Bit definition for RTC_DIVL register  *******************/
#define  RTC_DIVL_RTC_DIV                            ((uint16_t)0xFFFF)            /* RTC Clock Divider Low */

/*******************  Bit definition for RTC_CNTH register  *******************/
#define  RTC_CNTH_RTC_CNT                            ((uint16_t)0xFFFF)            /* RTC Counter High */

/*******************  Bit definition for RTC_CNTL register  *******************/
#define  RTC_CNTL_RTC_CNT                            ((uint16_t)0xFFFF)            /* RTC Counter Low */

/*******************  Bit definition for RTC_ALRMH register  *******************/
#define  RTC_ALRMH_RTC_ALRM                          ((uint16_t)0xFFFF)            /* RTC Alarm High */

/*******************  Bit definition for RTC_ALRML register  *******************/
#define  RTC_ALRML_RTC_ALRM                          ((uint16_t)0xFFFF)            /* RTC Alarm Low */

/******************************************************************************/
/*                        Serial Peripheral Interface                         */
/******************************************************************************/

/*******************  Bit definition for SPI_CTLR1 register  ********************/
#define  SPI_CTLR1_CPHA                              ((uint16_t)0x0001)            /* Clock Phase */
#define  SPI_CTLR1_CPOL                              ((uint16_t)0x0002)            /* Clock Polarity */
#define  SPI_CTLR1_MSTR                              ((uint16_t)0x0004)            /* Master Selection */

#define  SPI_CTLR1_BR                                ((uint16_t)0x0038)            /* BR[2:0] bits (Baud Rate Control) */
#define  SPI_CTLR1_BR_0                              ((uint16_t)0x0008)            /* Bit 0 */
#define  SPI_CTLR1_BR_1                              ((uint16_t)0x0010)            /* Bit 1 */
#define  SPI_CTLR1_BR_2                              ((uint16_t)0x0020)            /* Bit 2 */

#define  SPI_CTLR1_SPE                               ((uint16_t)0x0040)            /* SPI Enable */
#define  SPI_CTLR1_LSBFIRST                          ((uint16_t)0x0080)            /* Frame Format */
#define  SPI_CTLR1_SSI                               ((uint16_t)0x0100)            /* Internal slave select */
#define  SPI_CTLR1_SSM                               ((uint16_t)0x0200)            /* Software slave management */
#define  SPI_CTLR1_RXONLY                            ((uint16_t)0x0400)            /* Receive only */
#define  SPI_CTLR1_DFF                               ((uint16_t)0x0800)            /* Data Frame Format */
#define  SPI_CTLR1_CRCNEXT                           ((uint16_t)0x1000)            /* Transmit CRC next */
#define  SPI_CTLR1_CRCEN                             ((uint16_t)0x2000)            /* Hardware CRC calculation enable */
#define  SPI_CTLR1_BIDIOE                            ((uint16_t)0x4000)            /* Output enable in bidirectional mode */
#define  SPI_CTLR1_BIDIMODE                          ((uint16_t)0x8000)            /* Bidirectional data mode enable */

/*******************  Bit definition for SPI_CTLR2 register  ********************/
#define  SPI_CTLR2_RXDMAEN                           ((uint8_t)0x01)               /* Rx Buffer DMA Enable */
#define  SPI_CTLR2_TXDMAEN                           ((uint8_t)0x02)               /* Tx Buffer DMA Enable */
#define  SPI_CTLR2_SSOE                              ((uint8_t)0x04)               /* SS Output Enable */
#define  SPI_CTLR2_ERRIE                             ((uint8_t)0x20)               /* Error Interrupt Enable */
#define  SPI_CTLR2_RXNEIE                            ((uint8_t)0x40)               /* RX buffer Not Empty Interrupt Enable */
#define  SPI_CTLR2_TXEIE                             ((uint8_t)0x80)               /* Tx buffer Empty Interrupt Enable */

/********************  Bit definition for SPI_STATR register  ********************/
#define  SPI_STATR_RXNE                              ((uint8_t)0x01)               /* Receive buffer Not Empty */
#define  SPI_STATR_TXE                               ((uint8_t)0x02)               /* Transmit buffer Empty */
#define  SPI_STATR_CHSIDE                            ((uint8_t)0x04)               /* Channel side */
#define  SPI_STATR_UDR                               ((uint8_t)0x08)               /* Underrun flag */
#define  SPI_STATR_CRCERR                            ((uint8_t)0x10)               /* CRC Error flag */
#define  SPI_STATR_MODF                              ((uint8_t)0x20)               /* Mode fault */
#define  SPI_STATR_OVR                               ((uint8_t)0x40)               /* Overrun flag */
#define  SPI_STATR_BSY                               ((uint8_t)0x80)               /* Busy flag */

/********************  Bit definition for SPI_DATAR register  ********************/
#define  SPI_DATAR_DR                                ((uint16_t)0xFFFF)            /* Data Register */

/*******************  Bit definition for SPI_CRCR register  ******************/
#define  SPI_CRCR_CRCPOLY                            ((uint16_t)0xFFFF)            /* CRC polynomial register */

/******************  Bit definition for SPI_RCRCR register  ******************/
#define  SPI_RCRCR_RXCRC                             ((uint16_t)0xFFFF)            /* Rx CRC Register */

/******************  Bit definition for SPI_TCRCR register  ******************/
#define  SPI_TCRCR_TXCRC                             ((uint16_t)0xFFFF)            /* Tx CRC Register */

/******************  Bit definition for SPI_HSCR register  *******************/
#define  SPI_HSCR_HSRXEN                             ((uint16_t)0x0001)            
#define  SPI_HSCR_HSRXEN2                            ((uint16_t)0x0004)            

/******************************************************************************/
/*                                    TIM                                     */
/******************************************************************************/

/*******************  Bit definition for TIM_CTLR1 register  ********************/
#define  TIM_CEN                                     ((uint16_t)0x0001)            /* Counter enable */
#define  TIM_UDIS                                    ((uint16_t)0x0002)            /* Update disable */
#define  TIM_URS                                     ((uint16_t)0x0004)            /* Update request source */
#define  TIM_OPM                                     ((uint16_t)0x0008)            /* One pulse mode */
#define  TIM_DIR                                     ((uint16_t)0x0010)            /* Direction */

#define  TIM_CMS                                     ((uint16_t)0x0060)            /* CMS[1:0] bits (Center-aligned mode selection) */
#define  TIM_CMS_0                                   ((uint16_t)0x0020)            /* Bit 0 */
#define  TIM_CMS_1                                   ((uint16_t)0x0040)            /* Bit 1 */

#define  TIM_ARPE                                    ((uint16_t)0x0080)            /* Auto-reload preload enable */

#define  TIM_CTLR1_CKD                               ((uint16_t)0x0300)            /* CKD[1:0] bits (clock division) */
#define  TIM_CKD_0                                   ((uint16_t)0x0100)            /* Bit 0 */
#define  TIM_CKD_1                                   ((uint16_t)0x0200)            /* Bit 1 */

#define  TIM_CAPOV                                   ((uint16_t)0x4000) 
#define  TIM_CAPLVL                                  ((uint16_t)0x8000) 

