openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
#define  TIM_OC4FE                                   ((uint16_t)0x0400)            /* Output Compare 4 Fast enable */
#define  TIM_OC4PE                                   ((uint16_t)0x0800)            /* Output Compare 4 Preload enable */

#define  TIM_OC4M                                    ((uint16_t)0x7000)            /* OC4M[2:0] bits (Output Compare 4 Mode) */
#define  TIM_OC4M_0                                  ((uint16_t)0x1000)            /* Bit 0 */
#define  TIM_OC4M_1                                  ((uint16_t)0x2000)            /* Bit 1 */
#define  TIM_OC4M_2                                  ((uint16_t)0x4000)            /* Bit 2 */

#define  TIM_OC4CE                                   ((uint16_t)0x8000)            /* Output Compare 4 Clear Enable */


#define  TIM_IC3PSC                                  ((uint16_t)0x000C)            /* IC3PSC[1:0] bits (Input Capture 3 Prescaler) */
#define  TIM_IC3PSC_0                                ((uint16_t)0x0004)            /* Bit 0 */
#define  TIM_IC3PSC_1                                ((uint16_t)0x0008)            /* Bit 1 */

#define  TIM_IC3F                                    ((uint16_t)0x00F0)            /* IC3F[3:0] bits (Input Capture 3 Filter) */
#define  TIM_IC3F_0                                  ((uint16_t)0x0010)            /* Bit 0 */
#define  TIM_IC3F_1                                  ((uint16_t)0x0020)            /* Bit 1 */
#define  TIM_IC3F_2                                  ((uint16_t)0x0040)            /* Bit 2 */
#define  TIM_IC3F_3                                  ((uint16_t)0x0080)            /* Bit 3 */

#define  TIM_IC4PSC                                  ((uint16_t)0x0C00)            /* IC4PSC[1:0] bits (Input Capture 4 Prescaler) */
#define  TIM_IC4PSC_0                                ((uint16_t)0x0400)            /* Bit 0 */
#define  TIM_IC4PSC_1                                ((uint16_t)0x0800)            /* Bit 1 */

#define  TIM_IC4F                                    ((uint16_t)0xF000)            /* IC4F[3:0] bits (Input Capture 4 Filter) */
#define  TIM_IC4F_0                                  ((uint16_t)0x1000)            /* Bit 0 */
#define  TIM_IC4F_1                                  ((uint16_t)0x2000)            /* Bit 1 */
#define  TIM_IC4F_2                                  ((uint16_t)0x4000)            /* Bit 2 */
#define  TIM_IC4F_3                                  ((uint16_t)0x8000)            /* Bit 3 */

/*******************  Bit definition for TIM_CCER register  *******************/
#define  TIM_CC1E                                    ((uint16_t)0x0001)            /* Capture/Compare 1 output enable */
#define  TIM_CC1P                                    ((uint16_t)0x0002)            /* Capture/Compare 1 output Polarity */
#define  TIM_CC1NE                                   ((uint16_t)0x0004)            /* Capture/Compare 1 Complementary output enable */
#define  TIM_CC1NP                                   ((uint16_t)0x0008)            /* Capture/Compare 1 Complementary output Polarity */
#define  TIM_CC2E                                    ((uint16_t)0x0010)            /* Capture/Compare 2 output enable */
#define  TIM_CC2P                                    ((uint16_t)0x0020)            /* Capture/Compare 2 output Polarity */
#define  TIM_CC2NE                                   ((uint16_t)0x0040)            /* Capture/Compare 2 Complementary output enable */
#define  TIM_CC2NP                                   ((uint16_t)0x0080)            /* Capture/Compare 2 Complementary output Polarity */
#define  TIM_CC3E                                    ((uint16_t)0x0100)            /* Capture/Compare 3 output enable */
#define  TIM_CC3P                                    ((uint16_t)0x0200)            /* Capture/Compare 3 output Polarity */
#define  TIM_CC3NE                                   ((uint16_t)0x0400)            /* Capture/Compare 3 Complementary output enable */
#define  TIM_CC3NP                                   ((uint16_t)0x0800)            /* Capture/Compare 3 Complementary output Polarity */
#define  TIM_CC4E                                    ((uint16_t)0x1000)            /* Capture/Compare 4 output enable */
#define  TIM_CC4P                                    ((uint16_t)0x2000)            /* Capture/Compare 4 output Polarity */

/*******************  Bit definition for TIM_CNT register  ********************/
#define  TIM_CNT                                     ((uint16_t)0xFFFF)            /* Counter Value */

/*******************  Bit definition for TIM_PSC register  ********************/
#define  TIM_PSC                                     ((uint16_t)0xFFFF)            /* Prescaler Value */

/*******************  Bit definition for TIM_ATRLR register  ********************/
#define  TIM_ARR                                     ((uint16_t)0xFFFF)            /* actual auto-reload Value */

/*******************  Bit definition for TIM_RPTCR register  ********************/
#define  TIM_REP                                     ((uint8_t)0xFF)               /* Repetition Counter Value */

/*******************  Bit definition for TIM_CH1CVR register  *******************/
#define  TIM_CCR1                                    ((uint16_t)0xFFFF)            /* Capture/Compare 1 Value */

/*******************  Bit definition for TIM_CH2CVR register  *******************/
#define  TIM_CCR2                                    ((uint16_t)0xFFFF)            /* Capture/Compare 2 Value */

/*******************  Bit definition for TIM_CH3CVR register  *******************/
#define  TIM_CCR3                                    ((uint16_t)0xFFFF)            /* Capture/Compare 3 Value */

/*******************  Bit definition for TIM_CH4CVR register  *******************/
#define  TIM_CCR4                                    ((uint16_t)0xFFFF)            /* Capture/Compare 4 Value */

/*******************  Bit definition for TIM_BDTR register  *******************/
#define  TIM_DTG                                     ((uint16_t)0x00FF)            /* DTG[0:7] bits (Dead-Time Generator set-up) */
#define  TIM_DTG_0                                   ((uint16_t)0x0001)            /* Bit 0 */
#define  TIM_DTG_1                                   ((uint16_t)0x0002)            /* Bit 1 */
#define  TIM_DTG_2                                   ((uint16_t)0x0004)            /* Bit 2 */
#define  TIM_DTG_3                                   ((uint16_t)0x0008)            /* Bit 3 */
#define  TIM_DTG_4                                   ((uint16_t)0x0010)            /* Bit 4 */
#define  TIM_DTG_5                                   ((uint16_t)0x0020)            /* Bit 5 */
#define  TIM_DTG_6                                   ((uint16_t)0x0040)            /* Bit 6 */
#define  TIM_DTG_7                                   ((uint16_t)0x0080)            /* Bit 7 */

