openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
#define  USART_CTLR2_LINEN                           ((uint16_t)0x4000)            /* LIN mode enable */

/******************  Bit definition for USART_CTLR3 register  *******************/
#define  USART_CTLR3_EIE                             ((uint16_t)0x0001)            /* Error Interrupt Enable */
#define  USART_CTLR3_IREN                            ((uint16_t)0x0002)            /* IrDA mode Enable */
#define  USART_CTLR3_IRLP                            ((uint16_t)0x0004)            /* IrDA Low-Power */
#define  USART_CTLR3_HDSEL                           ((uint16_t)0x0008)            /* Half-Duplex Selection */
#define  USART_CTLR3_NACK                            ((uint16_t)0x0010)            /* Smartcard NACK enable */
#define  USART_CTLR3_SCEN                            ((uint16_t)0x0020)            /* Smartcard mode enable */
#define  USART_CTLR3_DMAR                            ((uint16_t)0x0040)            /* DMA Enable Receiver */
#define  USART_CTLR3_DMAT                            ((uint16_t)0x0080)            /* DMA Enable Transmitter */
#define  USART_CTLR3_RTSE                            ((uint16_t)0x0100)            /* RTS Enable */
#define  USART_CTLR3_CTSE                            ((uint16_t)0x0200)            /* CTS Enable */
#define  USART_CTLR3_CTSIE                           ((uint16_t)0x0400)            /* CTS Interrupt Enable */
#define  USART_CTLR3_LPWKUP_EN                       ((uint16_t)0x0800)            /* Low Power Wakeup Enable */
#define  USART_CTLR3_LPWKUP_CK_SRC                   ((uint16_t)0x1000)            /* Low Power Wakeup Clock Source */
#define  USART_CTLR3_LPWKUP_DLY_CFG                  ((uint16_t)0xE000)            /* Low Power Wakeup Delay Configuration */

/******************  Bit definition for USART_GPR register  ******************/
#define  USART_GPR_PSC                               ((uint16_t)0x00FF)            /* PSC[7:0] bits (Prescaler value) */
#define  USART_GPR_PSC_0                             ((uint16_t)0x0001)            /* Bit 0 */
#define  USART_GPR_PSC_1                             ((uint16_t)0x0002)            /* Bit 1 */
#define  USART_GPR_PSC_2                             ((uint16_t)0x0004)            /* Bit 2 */
#define  USART_GPR_PSC_3                             ((uint16_t)0x0008)            /* Bit 3 */
#define  USART_GPR_PSC_4                             ((uint16_t)0x0010)            /* Bit 4 */
#define  USART_GPR_PSC_5                             ((uint16_t)0x0020)            /* Bit 5 */
#define  USART_GPR_PSC_6                             ((uint16_t)0x0040)            /* Bit 6 */
#define  USART_GPR_PSC_7                             ((uint16_t)0x0080)            /* Bit 7 */

#define  USART_GPR_GT                                ((uint16_t)0xFF00)            /* Guard time value */

/******************  Bit definition for USART_CTLR4 register  ******************/
#define  USART_CTLR4_SELF_OD                         ((uint16_t)0x0001)            /* USART Open Drain Mode */
#define  USART_CTLR4_MS_ERRIE                        ((uint16_t)0x0002)            /* USART Space or Mark verification enable */
#define  USART_CTLR4_CHECK_SEL                       ((uint16_t)0x000C)            /* CHECK[1:0] bits (Check mode) */
#define  USART_CTLR4_CHECK_MARKENABLE                ((uint16_t)0x0008)            /* Bit 0 */
#define  USART_CTLR4_CHECK_APACEENABLE               ((uint16_t)0x000C)            /* Bit 1 */
      
/******************************************************************************/
/*                            Window WATCHDOG                                 */
/******************************************************************************/

/*******************  Bit definition for WWDG_CTLR register  ********************/
#define  WWDG_CTLR_T                                 ((uint8_t)0x7F)               /* T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define  WWDG_CTLR_T0                                ((uint8_t)0x01)               /* Bit 0 */
#define  WWDG_CTLR_T1                                ((uint8_t)0x02)               /* Bit 1 */
#define  WWDG_CTLR_T2                                ((uint8_t)0x04)               /* Bit 2 */
#define  WWDG_CTLR_T3                                ((uint8_t)0x08)               /* Bit 3 */
#define  WWDG_CTLR_T4                                ((uint8_t)0x10)               /* Bit 4 */
#define  WWDG_CTLR_T5                                ((uint8_t)0x20)               /* Bit 5 */
#define  WWDG_CTLR_T6                                ((uint8_t)0x40)               /* Bit 6 */

#define  WWDG_CTLR_WDGA                              ((uint8_t)0x80)               /* Activation bit */

/*******************  Bit definition for WWDG_CFGR register  *******************/
#define  WWDG_CFGR_W                                 ((uint16_t)0x007F)            /* W[6:0] bits (7-bit window value) */
#define  WWDG_CFGR_W0                                ((uint16_t)0x0001)            /* Bit 0 */
#define  WWDG_CFGR_W1                                ((uint16_t)0x0002)            /* Bit 1 */
#define  WWDG_CFGR_W2                                ((uint16_t)0x0004)            /* Bit 2 */
#define  WWDG_CFGR_W3                                ((uint16_t)0x0008)            /* Bit 3 */
#define  WWDG_CFGR_W4                                ((uint16_t)0x0010)            /* Bit 4 */
#define  WWDG_CFGR_W5                                ((uint16_t)0x0020)            /* Bit 5 */
#define  WWDG_CFGR_W6                                ((uint16_t)0x0040)            /* Bit 6 */

#define  WWDG_CFGR_WDGTB                             ((uint16_t)0x0180)            /* WDGTB[1:0] bits (Timer Base) */
#define  WWDG_CFGR_WDGTB0                            ((uint16_t)0x0080)            /* Bit 0 */
#define  WWDG_CFGR_WDGTB1                            ((uint16_t)0x0100)            /* Bit 1 */

#define  WWDG_CFGR_EWI                               ((uint16_t)0x0200)            /* Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_STATR register  ********************/
#define  WWDG_STATR_EWIF                       ((uint8_t)0x01)               /* Early Wakeup Interrupt Flag */

/******************************************************************************/
/*                                 ARGB                                     */
/******************************************************************************/
/*******************  Bit definition for ARGB_CTLR register  *******************/
#define  ARGB_TE                                     ((uint32_t)0x00000001)
#define  ARGB_DMAEN                                  ((uint32_t)0x00000002)
#define  ARGB_MODE                                   ((uint32_t)0x00000004)
#define  ARGB_LSB                                    ((uint32_t)0x00000008)

#define  ARGB_FRHIE                                  ((uint32_t)0x00000100)
#define  ARGB_RSTIE                                  ((uint32_t)0x00000200)
#define  ARGB_TCIE                                   ((uint32_t)0x00000400)
#define  ARGB_BYTEIE                                 ((uint32_t)0x00000800)
#define  ARGB_HALFIE                                 ((uint32_t)0x00001000)
#define  ARGB_TXEIE                                  ((uint32_t)0x00002000)

/*******************  Bit definition for ARGB_DAT_ARR register  *******************/
#define  ARGB_DAT_ARR                                ((uint32_t)0x00000FFF)

