openwch/ch32x315/EVT/EXAM/SRC/Peripheral/inc/ch32x3x5.h
/*******************  Bit definition for ARGB_RST_ARR register  *******************/
#define  ARGB_RST_ARR                                ((uint32_t)0x0001FFFF)

/*******************  Bit definition for ARGB_CCRL register  *******************/
#define  ARGB_CCRL                                   ((uint32_t)0x00000FFF)

/*******************  Bit definition for ARGB_CCRH register  *******************/
#define  ARGB_CCRH                                   ((uint32_t)0x00000FFF)

/*****************  Bit definition for ARGB_DAT_CYC register  ******************/
#define  ARGB_DAT_CYC                                ((uint32_t)0x0000FFFF)

/****************  Bit definition for ARGB_DAT_DATAR register  *****************/
#define  ARGB_DATA                                   ((uint32_t)0x000000FF)

/****************  Bit definition for ARGB_STATR register  *****************/
#define  ARGB_FRHIF                                  ((uint32_t)0x00000001)
#define  ARGB_RSTIF                                  ((uint32_t)0x00000002)
#define  ARGB_TCIF                                   ((uint32_t)0x00000004)
#define  ARGB_BYTEIF                                 ((uint32_t)0x00000008)
#define  ARGB_HALFIF                                 ((uint32_t)0x00000010)
#define  ARGB_TXEIF                                  ((uint32_t)0x00000020)

#define  ARGB_STATE                                  ((uint32_t)0x000000C0)
#define  ARGB_STATE_0                                ((uint32_t)0x00000040)
#define  ARGB_STATE_1                                ((uint32_t)0x00000080)

#define  ARGB_BIT_CNT                                ((uint32_t)0x00000700)
#define  ARGB_BYTE_CNT                               ((uint32_t)0xFFFF0000)

/****************  Bit definition for ARGB_CNTR register  *****************/
#define  ARGB_CNT                                    ((uint32_t)0x0001FFFF)


#include "ch32x3x5_conf.h"

#ifdef __cplusplus
}
#endif

#endif 




